2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
// Bibliothek:       XMC1100-LibHaas.c Vers 0.82 vom 19.09.2021
// Controller:       XMC1100 Board XMC1100 Boot Kit
// Adapterboard:	 XMC-Learnboard Version0_9
// Ausgangsversion:  Version 1.8 Birk, Bubbers
// Autor			 Haas
#include <xmc1100-LibHaas.h>

// Global Variablen
// RS232
char rs232Receivedata[256];
uint8_t rs232ReceivedataPointer=0;
uint8_t rs232EnterReceive=0;
// UART
char uartReceivedata[256];
uint8_t uartReceivedataPointer=0;
uint8_t uartEnterReceive=0;

// Definition der lokalen Funktionen:
uint16_t bit_set_clr(uint16_t wert, uint16_t set ,uint16_t bitnr);
void clock_init(void);

//***************************************************************
// ab hier Funktionen für Port-Ein-/Ausgabe
//***************************************************************

// --------------------------------------------------------------
// Einzelnes Bit für Ein- oder Ausgabe initialisieren
// port: P0,P1,P2 bitnr: 0..15 direction: INP 0, OUTP 1
//---------------------------------------------------------------
void bit_init(uint8_t port, uint8_t bitnr, uint8_t direction)
{
	switch (port)
	{
		case 0 :
			{if (bitnr < 4 )
				{ if (direction == 1) PORT0->IOCR0 |=1UL << ((bitnr * 8)+7);
				  else PORT0->IOCR0 &= ~(1UL << ((bitnr * 8 ) + 7 ));
				}
			 if ( (bitnr <8) && (bitnr > 3))
					 { if (direction == 1) PORT0->IOCR4 |= 1UL<< (((bitnr-4) * 8)+7);
					   else PORT0->IOCR4 &= ~(1UL << (((bitnr-4) * 8)+7) );
					 }
			 if ( (bitnr <12) && (bitnr > 7))
			 		 { if (direction == 1) PORT0->IOCR8 |= 1UL << (((bitnr-8) * 8)+7);
			 		   else PORT0->IOCR8 &= ~(1UL << (((bitnr-8) * 8)+7) );
			 		 }
			 if ( (bitnr <16) && (bitnr > 11))
			 		{ if (direction == 1) PORT0->IOCR12 |= 1UL << (((bitnr-12) * 8)+7);
			 		  else PORT0->IOCR12 &= ~(1UL << (((bitnr-12) * 8)+7) );
			 		}
			}
			break;
	  case 1 :
			{
				{if (bitnr < 4 )
					{ if (direction == 1) PORT1->IOCR0 |=1UL << ((bitnr * 8)+7);
						else PORT1->IOCR0 &= ~(1UL << ((bitnr * 8 ) + 7 ));
					}
			if ((bitnr < 8) && (bitnr > 3)) {
				if (direction == 1) PORT1->IOCR4 |= 1UL << (((bitnr - 4) * 8) + 7);
				else
					PORT1->IOCR4 &= ~(1UL << (((bitnr - 4) * 8) + 7));
			}

				}
			}
			break;

	  case 2 : //Achtung!! Nur Pins P2.0, P2.1, P2.10 und P2.11 sind als Out Pin einstellbar
	  	{
	  		if (bitnr < 2 ) {
	  			CLR_BIT(PORT2->PDISC,bitnr); // digital Pad aktiv
	  			if (direction == 1) PORT2->IOCR0 |=1UL << ((bitnr * 8)+7);
					else PORT2->IOCR0 &= ~(1UL << ((bitnr * 8 ) + 7 ));
	  		}
				if ((bitnr > 1)&&(bitnr<4)) {
					CLR_BIT(PORT2->PDISC,bitnr); // digital Pad aktiv
					PORT2->IOCR0 &= ~(1UL << ((bitnr * 8) + 7));
				}
	  		if ((bitnr < 8) && (bitnr > 3)) {
	  			    CLR_BIT(PORT2->PDISC,bitnr); // digital Pad aktiv
					PORT2->IOCR4 &= ~(1UL << (((bitnr-4) * 8 ) + 7 ));
				}
	  		if ((bitnr < 10) && (bitnr > 7)) {
	  			PORT2->IOCR8 &= ~(1UL << (((bitnr-8) * 8 ) + 7 ));
	  		}
	  		if (bitnr > 9 ) {
	  			CLR_BIT(PORT2->PDISC,bitnr); // digital Pad aktiv
	  			if (direction == 1) PORT2->IOCR8 |=1UL << (((bitnr-8) * 8)+7);
	  			else PORT2->IOCR8 &= ~(1UL << (((bitnr-8) * 8 ) + 7 ));
	  		}
  			break;
	  	}
	  }
}

/* --------------------------------------------------------------
* Einzelnes Bit für Ein- oder Ausgabe initialisieren
* port: P0,P1,P2 bitnr: 0..15 direction: INP 0, OUTP 1
* mode: NO_PULL PULLUP PULLDOWN
*/
void bit_init_mode (uint8_t port, uint8_t bitnr, uint8_t direction, uint8_t mode)
{
	switch (port)
	{
		case 0 :
		{
			if (bitnr < 4 ) {
				if (direction == 1) {
					PORT0->IOCR0 |=1UL << ((bitnr * 8)+7);
					PORT0->IOCR0 &= ~(0x0000000F << ((bitnr * 8)+3));
				}
				else {
					PORT0->IOCR0 &= ~(1UL << ((bitnr * 8 ) + 7 ));
					if (mode == PULLUP) {
						PORT0->IOCR0 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT0->IOCR0 |= (1UL << ((bitnr * 8)+4) );
					} else if (mode == PULLDOWN) {
						PORT0->IOCR0 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT0->IOCR0 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
			if ( (bitnr <8) && (bitnr > 3)) {
				if (direction == 1) {
					PORT0->IOCR4 |= 1UL<< (((bitnr-4) * 8)+7);
					PORT0->IOCR4 &= ~(0x0000000F << (((bitnr-4) * 8)+3));
				}
				else {
					PORT0->IOCR4 &= ~(1UL << (((bitnr-4) * 8)+7) );
					if (mode == PULLUP) {
						PORT0->IOCR4 &= ~(0x0000001F << (((bitnr-4) * 8)+3) );
						PORT0->IOCR4 |= (1UL << (((bitnr-4) * 8)+4) );
					}else if (mode == PULLDOWN) {
						PORT0->IOCR4 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT0->IOCR4 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
			if ( (bitnr <12) && (bitnr > 7)) {
				if (direction == 1) {
					PORT0->IOCR8 |= 1UL << (((bitnr-8) * 8)+7);
					PORT0->IOCR8 &= ~(0x0000000F << (((bitnr-8) * 8)+3));
				}
				else {
					PORT0->IOCR8 &= ~(1UL << (((bitnr-8) * 8)+7) );
					if (mode == PULLUP) {
						PORT0->IOCR8 &= ~(0x0000001F << (((bitnr-8) * 8)+3) );
						PORT0->IOCR8 |= (1UL << (((bitnr-8) * 8)+4) );
					} else if (mode == PULLDOWN) {
						PORT0->IOCR8 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT0->IOCR8 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
			if ( (bitnr <16) && (bitnr > 11)) {
				if (direction == OUTP){
					PORT0->IOCR12 |= 1UL << (((bitnr-12) * 8)+7);
					PORT0->IOCR12 &= ~(0x0000000F << (((bitnr-12) * 8)+3));
				}
				else {
					PORT0->IOCR12 &= ~(1UL << (((bitnr-12) * 8)+7) );
					if (mode == PULLUP) {
						PORT0->IOCR12 &= ~(0x0000001F << (((bitnr-12) * 8)+3) );
						PORT0->IOCR12 |= (1UL << (((bitnr-12) * 8)+4) );
					}else if (mode == PULLDOWN) {
						PORT0->IOCR12 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT0->IOCR12 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
		}
		break;
		case 1 :
		{
			if (bitnr < 4 ) {
				if (direction == 1) {
					PORT1->IOCR0 |=1UL << ((bitnr * 8)+7);
					PORT1->IOCR0 &= ~(0x0000000F << ((bitnr * 8)+3));
				}
				else {
					PORT1->IOCR0 &= ~(1UL << ((bitnr * 8 ) + 7 ));
					if (mode == PULLUP) {
						PORT1->IOCR0 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT1->IOCR0 |= (1UL << ((bitnr * 8)+4) );
					} else if (mode == PULLDOWN) {
						PORT1->IOCR0 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT1->IOCR0 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
			if ( (bitnr <8) && (bitnr > 3)) {
				if (direction == 1) {
					PORT1->IOCR4 |= 1UL<< (((bitnr-4) * 8)+7);
					PORT1->IOCR4 &= ~(0x0000000F << (((bitnr-4) * 8)+3));
				}
				else {
					PORT1->IOCR4 &= ~(1UL << (((bitnr-4) * 8)+7) );
					if (mode == PULLUP) {
						PORT1->IOCR4 &= ~(0x0000001F << (((bitnr-4) * 8)+3) );
						PORT1->IOCR4 |= (1UL << (((bitnr-4) * 8)+4) );
					}else if (mode == PULLDOWN) {
						PORT1->IOCR4 &= ~(0x0000001F << ((bitnr * 8)+3) );
						PORT1->IOCR4 |= (1UL << ((bitnr * 8)+3) );
					}
				}
			}
		}
		break;

		case 2 :
			if (bitnr == 0) { //P2.0
			 if (direction == OUTP) {
				 CLR_BIT(PORT2->PDISC,0); // digital Pad aktiv
				 PORT2->IOCR0 &= 0xffffff00;
				 PORT2->IOCR0 |= 0x00000080;
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,0); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR0 &= 0xFFFFFF00;
					 PORT2->IOCR0 |= 0x00000010;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR0 &= 0xFFFFFF00;
					 PORT2->IOCR0 |= 0x00000008;
				 } else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,0); //Analog Modus aktiv
				 }
			 }
		 }
		 if (bitnr == 1) { //P2.1
			 if (direction == OUTP) {
				 CLR_BIT(PORT2->PDISC,1); // digital Pad aktiv
				 PORT2->IOCR0 &= 0xffff00ff;
				 PORT2->IOCR0 |= 0x00008000;
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,1); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR0 &= 0xFFFF00ff;
					 PORT2->IOCR0 |= 0x00001000;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR0 &= 0xFFFF00ff;
					 PORT2->IOCR0 |= 0x00000800;
				 } else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,1); //Analog Modus aktiv
				 }
			 }
		 }
		 if (bitnr == 2) { //P2.2
			 if (direction == OUTP) {
				 // nicht moeglich
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,2); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR0 &= 0xFF00ffff;
					 PORT2->IOCR0 |= 0x00100000;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR0 &= 0xFF00ffff;
					 PORT2->IOCR0 |= 0x00080000;
				 } else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,2); //Analog Modus aktiv
				 }
			 }
		 }
		 if (bitnr == 3) { //P2.3
			 if (direction == OUTP) {
				 // nicht moeglich
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,3); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR0 &= 0x00ffffff;
					 PORT2->IOCR0 |= 0x10000000;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR0 &= 0x00ffffff;
					 PORT2->IOCR0 |= 0x08000000;
				 } else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,3); //Analog Modus aktiv
				 }
			 }
		 }
		 if ((bitnr > 3) && (bitnr < 8)) { //P2.4 bis P2.7
			 if (direction == OUTP) {
				 // nicht moeglich
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,bitnr); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR4 &= ~(0xff<<((bitnr-4)*8)); //PORT2->IOCR1 &= 0xffffff00;
					 PORT2->IOCR4 |= 0x10<<((bitnr-4)*8);    //PORT2->IOCR4 |= 0x00000010;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR4 &= ~(0xff<<((bitnr-4)*8)); //PORT2->IOCR1 &= 0xffffff00;
					 PORT2->IOCR4 |= 0x08<<((bitnr-4)*8);    //PORT2->IOCR4 |= 0x00000010;
				 } else if (mode == ANALOG) {
					 SET_BIT(PORT2->PDISC,bitnr); //Analog Modus aktiv
				 }
			 }
		 }
		 if (bitnr == 8) { //P2.8
			if (direction == OUTP) {
				CLR_BIT(PORT2->PDISC,8); // digital Pad aktiv
				PORT2->IOCR8 &= 0xffffff00;
				PORT2->IOCR8 |= 0x00000080;
			} else if (direction == INP) {
				CLR_BIT(PORT2->PDISC,8); // digital Pad aktiv
				if (mode==PULLUP) {
					PORT2->IOCR8 &= 0xFFFFFF00;
					PORT2->IOCR8 |= 0x00000010;
				} else if (mode==PULLDOWN) {
					PORT2->IOCR8 &= 0xFFFFFF00;
					PORT2->IOCR8 |= 0x00000008;
				} else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,8); //Analog Modus aktiv
				}
			}
		 }
		 if (bitnr == 9) { //P2.9
			if (direction == OUTP) {
				CLR_BIT(PORT2->PDISC,9); // digital Pad aktiv
				PORT2->IOCR8 &= 0xffff00ff;
				PORT2->IOCR8 |= 0x00008000;
			} else if (direction == INP) {
				CLR_BIT(PORT2->PDISC,9); // digital Pad aktiv
				if (mode==PULLUP) {
					PORT2->IOCR8 &= 0xFFFF00FF;
					PORT2->IOCR8 |= 0x00001000;
				} else if (mode==PULLDOWN) {
					PORT2->IOCR8 &= 0xFFFF00FF;
					PORT2->IOCR8 |= 0x00000800;
				} else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,9); //Analog Modus aktiv
				}
			}
		 }
		 if (bitnr == 10) { //P2.10
			 if (direction == OUTP) {
				 CLR_BIT(PORT2->PDISC,10); // digital Pad aktiv
				 PORT2->IOCR8 &= 0xff00ffff;
				 PORT2->IOCR8 |= 0x00800000;
			 } else if (direction == INP) {
				 CLR_BIT(PORT2->PDISC,10); // digital Pad aktiv
				 if (mode==PULLUP) {
					 PORT2->IOCR8 &= 0xFF00FFFF;
					 PORT2->IOCR8 |= 0x00100000;
				 } else if (mode==PULLDOWN) {
					 PORT2->IOCR8 &= 0xFF00FFFF;
					 PORT2->IOCR8 |= 0x00080000;
				 } else if (mode == ANALOG) {
					 SET_BIT(PORT2->PDISC,10); //Analog Modus aktiv
				 }
			 }
		 }
		 if (bitnr == 11) { //P2.11
			if (direction == OUTP) {
				CLR_BIT(PORT2->PDISC,11); // digital Pad aktiv
				PORT2->IOCR8 &= 0x00ffffff;
				PORT2->IOCR8 |= 0x80000000;
			} else if (direction == INP) {
				CLR_BIT(PORT2->PDISC,11); // digital Pad aktiv
				if (mode==PULLUP) {
					PORT2->IOCR8 &= 0x00FFFFFF;
					PORT2->IOCR8 |= 0x10000000;
				} else if (mode==PULLDOWN) {
					PORT2->IOCR8 &= 0x00FFFFFF;
					PORT2->IOCR8 |= 0x08000000;
				} else if (mode == ANALOG) {
					SET_BIT(PORT2->PDISC,11); //Analog Modus aktiv
				}
			}
		 }
		 break;
	}
}

uint16_t bit_set_clr(uint16_t wert, uint16_t set ,uint16_t bitnr)
{
	if ( set == 1 ) return  wert |= (0x01 << bitnr);
	else return wert &= ~(0x01 << bitnr);
}

//---------------------------------------------------------------
//Gesamtes Port für Ein- oder Ausgabe initialisieren
// port: P0,P1 direction: INP 0, OUTP 1
//---------------------------------------------------------------
 void port_init(uint8_t port, uint8_t direction)

{
	switch(port)
	{
		case 0:	if (direction == OUTP) {
					PORT0->IOCR0 = 0x80808080;  // auf Ausgang setzen
					PORT0->IOCR4 = 0x80808080;
					PORT0->IOCR8 = 0x80808080;
					PORT0->IOCR12 = 0x80808080;
					}
				else {
					PORT0->IOCR0 = 0x00;
					PORT0->IOCR4 = 0x00;
					PORT0->IOCR8 = 0x00;
					PORT0->IOCR12 = 0x00;
					}
					break;
		case 1:	 if (direction == OUTP) {
					PORT1->IOCR0 = 0x80808080;  // auf Ausgang setzen
					PORT1->IOCR4 = 0x80808080;
								}
				else {
					PORT1->IOCR0 = 0x00;
					PORT1->IOCR4 = 0x00;
			}
				break;

