2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
		case 2:	 if (direction == OUTP) {
					PORT2->IOCR0 = 0x80808080;  // auf Ausgang setzen geht aber nur für ein paar Pins an P2
					PORT2->IOCR4 = 0x80808080;
					PORT2->IOCR8 = 0x80808080;
					PORT2->PDISC = 0; // digital Pad aktiv
				}
				else {
					PORT2->IOCR0 = 0x00;
					PORT2->IOCR4 = 0x00;
					PORT2->IOCR8 = 0x00;
					PORT2->PDISC = 0; // digital Pad aktiv
				}
				break;

	}
}

//---------------------------------------------------------------
// Einzelnes Portbit einlesen
// port: P0,P1,P2 bitnr: 0..15
//---------------------------------------------------------------
uint8_t bit_read(uint8_t port, uint8_t bitnr)
{
  uint16_t temp;

  temp = port_read(port);
  return ((temp>>bitnr) & 0x01);
}
//---------------------------------------------------------------
// Einzelnes Portbit ausgeben
// port: P0,P1 bitnr: 0..15 P2=>bitnr 9..11
//---------------------------------------------------------------
void bit_write(uint8_t port, uint8_t bitnr, uint8_t value)
{
	//uint32_t temp;
	value &= 0x01;       // value darf nur 0 oder 1 sein!
	switch (port)
	{
		case 0 :
			if (value == 1) {
				//PORT0->OUT |= 1UL << bitnr ;
				PORT0->OMR &= ~(1UL << (bitnr + 16)); // loeschen des Bits
				PORT0->OMR |= 1UL << bitnr;      // setzen
				//temp=PORT0->OMR;
				//temp &= ~(1UL << (bitnr + 16)); // loeschen des Bits
				//temp |= 1UL << bitnr;      // setzen
				//PORT0->OMR = temp;
			}
			else {
				//PORT0->OUT &= ~( 1UL << bitnr);
				PORT0->OMR &= ~(1UL << bitnr);      // Set = 0
				PORT0->OMR |= 1UL << (bitnr + 16); // Reset = 0
				//temp = PORT0->OMR;
				//temp &= ~(1UL << bitnr);      // Set = 0
				//temp |= 1UL << (bitnr + 16); // Reset = 0
				//PORT0->OMR = temp;
			}
			break;
	    case 1 :
	  	  	  {if (value == 1) PORT1->OUT |= 1UL << bitnr ;
	  		   else PORT1->OUT &= ~( 1UL << bitnr);
	  		  }
			break;

	    case 2 :
			  {if (value == 1) PORT2->OUT |= 1UL << bitnr ;
			   else PORT2->OUT &= ~( 1UL << bitnr);
			  }
			break;
		}
 }

//---------------------------------------------------------------
// Gesamtes Port einlesen
// port: P0,P1,P2
//---------------------------------------------------------------
uint16_t port_read (uint8_t port)
{
	uint16_t temp;
  switch (port)
  {
    case 0: temp = PORT0->IN; return temp; break;
    case 1: temp = PORT1->IN; return temp; break;
    case 2: temp = PORT2->IN; return temp; break;
    default: return 0; break;
  }
  //return 0;
}

//----------------------------------------------------------------
//Gesamtes Port P0 initialisieren mit IO-Bitmaske
// Bit der Maske 0 -> Input, 1 -> Output
// z.B.0x00ff rechte 8 Bit Ausgabe, linke 8 Bit Eingabe (nur 6 sichtbar)
// 0b0000000011111111 = 0x00ff
//----------------------------------------------------------------
void port0_init_maske(uint16_t io_maske)
{
	uint8_t z;
	for (z = 0; z<16;z++)				// 16 Bits (0..15)
	{
		bit_init(P0,z,io_maske&0b1);	// einzeln initialisieren
		io_maske >>= 1;					// nächste Bit der Maske
	}
}

//---------------------------------------------------------------
// Gesamtes Port ausgeben
// port: P0,P1
//---------------------------------------------------------------
void port_write(uint8_t port, uint16_t value)
{
  switch (port)
  {
    case 0: PORT0->OUT  = value; break;
    case 1: PORT1->OUT = value; break;
    case 2: PORT1->OUT = value; break;
  }
}
// ***************************************************************
// ab hier PWM-Funktionen
// ***************************************************************

#define periode_pwm_8 2550 // 8-Bit-Periode fuer ca. 1.5 kHz
#define periode_pwm 50000 // 16-Bit-Periode 50000 für leichtere Berechnung, ca. 640 Hz
//#define periode_pwm 0xffff // max 16-Bit-Periode


//------- Takt für 8-Bit- und 16-Bit-Funktionen PWM --------------------------------
void clock_init(void)
{
	SCU_GENERAL->PASSWD = 0x000000C0UL;
	SCU_CLK->CLKCR = 0x3FF10100;			// Config SCU Clock = 32MHz , PCLK = 64 MHz
	while((SCU_CLK->CLKCR)&0x40000000UL);	// wait for VDDC to stabilize
	SCU_GENERAL->PASSWD = 0x000000C3UL;
	SCU_GENERAL->PASSWD = 0x000000C0UL;
	SCU_CLK->CGATCLR0 |= 0x04;				// Disable CCU4 Gating
	while((SCU_CLK->CLKCR)&0x40000000UL);	// wait for VDDC to stabilize
	SCU_GENERAL->PASSWD = 0x000000C3UL;
	SCU_CLK->CGATSET0 |= 0xfff;				// Modul  Clock enable , all Modul's
}
//-----------------------------------------------------------------------
// 8-Bit-PWM1-Ausgang P0.6 initialisieren,
// Hinweis: anschließend starten mit pwm1_start oder pwm1_start_interrupt
//-----------------------------------------------------------------------
void pwm1_init_8(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;				// Enable CCU40
	// CCU40 Init:
	 CCU40->GIDLC = 0x10F; 					// Vorteiler enable,CCU4x enable
	 CCU40_CC40->TC= 4;  					// Shadow transfer enable on clear
	 CCU40_CC40->PSC = 0x4;					// Vorteiler , hier 64Mhz/16
	 CCU40_CC40->PRS = periode_pwm_8; 		// Period Register set , hier ca. 1.5 kHz

		// CCU40 Compare:  ( Ausganspin P0.6 )
	 CCU40_CC40->CRS = 1270;				// Compare Wert,hier 1:1 Imp
	 CCU40->GCSS = 1; 						// Shadow transfer request slice 0
	 //PORT0->IOCR0 = 0xA0;					// Alt4=>OUT bei P0.0
	 PORT0->IOCR4 |= 0xA0<<16;				// Alt4=>OUT bei P0.6
	 //CCU40_CC40->TCSET = 0x1; //starts counting
}
//---------------------------------------------------------------
// PWM1-Ausgang P0.6 initialisieren (16-Bit),
// Hinweis: anschließend starten mit pwm1_start oder pwm1_start_interrupt
// eingestellte Periodendauer bei #define periode_pwm 50000
//----------------------------------------------------------------
void pwm1_init(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;				// Enable CCU40
	// CCU40 Init:
	CCU40->GIDLC = 0x10F; 					// Vorteiler enable,CCU4x enable
	CCU40_CC40->TC = 4;  					// Shadow transfer enable on clear
	CCU40_CC40->PSC = 0x1;					// Vorteiler , hier 64Mhz/2
	CCU40_CC40->PRS = periode_pwm; 			// Period Register set, hier ca. 640 Hz

	// CCU40 Compare:  (Ausganspin P0.6)
	CCU40_CC40->CRS = 25000;				// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1; 						// Shadow transfer request slice 0
	//PORT0->IOCR0 = 0xA0;					// Alt4=>OUT bei P0.0
	PORT0->IOCR4 |= 0xA0<<16;				// Alt4=>OUT bei P0.6
	//CCU40_CC40->TCSET = 0x1; //starts counting
}
//---------------------------------------------------------------
// 8-Bit-PWM2-Ausgang P0.7 initialisieren
//---------------------------------------------------------------
void pwm2_init_8(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;				// Enable CCU40
		// CCU41 Init:
	CCU40->GIDLC = 0x10F; 					// Vorteiler enable,CCU4x enable
	CCU40_CC41->TC= 4;  					// Shadow transfer enable on clear
	CCU40_CC41->PSC = 0x4;					// Vorteiler , hier 64Mhz/16
	CCU40_CC41->PRS = periode_pwm_8; 			// Period Register set , hier ca. 1.5 kHz

