2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
		// CCU40 Compare:  ( Ausganspin P0.0 )
	CCU40_CC41->CRS = 1270;				// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1<<4; 				// Shadow transfer request slice 1
	//PORT0->IOCR0 |= 0xA0 <<8;			// Alt4=>OUT bei P0.1
	PORT0->IOCR4 |= 0xA0<<24;			// Alt4=>OUT bei P0.7
}
//---------------------------------------------------------------
// PWM2-Ausgang P0.7 initialisieren (16-Bit)
// Hinweis: anschließend starten mit pwm2_start oder pwm2_start_interrupt
// eingestellte Periodendauer bei #define periode_pwm 50000
//---------------------------------------------------------------
void pwm2_init(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;				// Enable CCU40
	// CCU41 Init:
	CCU40->GIDLC = 0x10F; 					// Vorteiler enable,CCU4x enable
	CCU40_CC41->TC = 4;  					// Shadow transfer enable on clear
	CCU40_CC41->PSC = 0x1;					// Vorteiler , hier 64Mhz/2
	CCU40_CC41->PRS = periode_pwm; 			// Period Register set, hier ca. 640 Hz

	// CCU40 Compare:  (Ausganspin P0.0)
	CCU40_CC41->CRS = 25000;			// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1<<4; 				// Shadow transfer request slice 1
	//PORT0->IOCR0 |= 0xA0 <<8;			// Alt4=>OUT bei P0.1
	PORT0->IOCR4 |= 0xA0<<24;			// Alt4=>OUT bei P0.7
}
//---------------------------------------------------------------
// 8-Bit-PWM3-Ausgang P0.8 initialisieren
//---------------------------------------------------------------
void pwm3_init_8(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;			// Enable CCU40
		// CCU42 Init:
	CCU40->GIDLC = 0x10F; 				// Vorteiler enable,CCU4x enable
	CCU40_CC42->TC= 4;  				// Shadow transfer enable on clear
	CCU40_CC42->PSC = 0x4;				// Vorteiler , hier 64Mhz/16
	CCU40_CC42->PRS = periode_pwm_8; 		// Period Register set , hier ca. 1.5 kHz

		// CCU40 Compare:  ( Ausganspin P0.8 )
	CCU40_CC42->CRS = 1270;				// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1<<8; 				// Shadow transfer request slice 2
	//PORT0->IOCR0 |= 0xA0 << 16;		// Alt4=>OUT bei P0.2
	PORT0->IOCR8 |= 0xA0;				// Alt4=>OUT bei P0.8
}
//---------------------------------------------------------------
// PWM3-Ausgang P0.8 initialisieren (16-Bit)
// Hinweis: anschließend starten mit pwm3_start oder pwm3_start_interrupt
// eingestellte Periodendauer bei #define periode_pwm 50000
//---------------------------------------------------------------
void pwm3_init(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;			// Enable CCU40
		// CCU42 Init:
	CCU40->GIDLC = 0x10F; 				// Vorteiler enable,CCU4x enable
	CCU40_CC42->TC = 4;  				// Shadow transfer enable on clear
	CCU40_CC42->PSC = 0x1;				// Vorteiler , hier 64Mhz/2
	CCU40_CC42->PRS = periode_pwm; 		// Period Register set , hier ca. 640 Hz

	// CCU40 Compare:  (Ausganspin P0.8)
	CCU40_CC42->CRS = 25000;			// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1<<8; 				// Shadow transfer request slice 2
	//PORT0->IOCR0 |= 0xA0 << 16;		// Alt4=>OUT bei P0.2
	PORT0->IOCR8 |= 0xA0;				// Alt4=>OUT bei P0.8
}
//---------------------------------------------------------------
// PWM4-Ausgang P0.9 initialisieren (16-Bit)
// Hinweis: anschließend starten mit pwm4_start oder pwm4_start_interrupt
// eingestellte Periodendauer bei #define periode_pwm 50000
//---------------------------------------------------------------
void pwm4_init(void)
{
	clock_init();
	SCU_GENERAL->CCUCON = 1;			// Enable CCU40
		// CCU42 Init:
	CCU40->GIDLC = 0x10F; 				// Vorteiler enable,CCU4x enable
	CCU40_CC43->TC = 4;  				// Shadow transfer enable on clear
	CCU40_CC43->PSC = 0x1;				// Vorteiler , hier 64Mhz/2
	CCU40_CC43->PRS = periode_pwm; 		// Period Register set , hier ca. 640 Hz

	// CCU40 Compare:  (Ausganspin P0.8)
	CCU40_CC43->CRS = 25000;			// Compare Wert,hier 1:1 Imp
	CCU40->GCSS = 1<<12; 				// Shadow transfer request slice 3
	//PORT0->IOCR0 |= 0xA0 << 16;		// Alt4=>OUT bei P0.2
	//PORT0->IOCR8 &= !(0xF8 << 8);
	PORT0->IOCR8 |= 0xA0 << 8;				// Alt4=>OUT bei P0.9
}
//---------------------------------------------------------------
// 8-Bit-Comparewert einstellen, der den Tastgrad des 8-Bit-PWM-Singals verändert
// compare = 0...255, Tastgrad 50% bei compare = 127
//---------------------------------------------------------------
void pwm1_duty_cycle_8 (uint8_t compare)
{
	CCU40_CC40->CRS = periode_pwm_8 - (compare * 10);// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1; 					//Shadow transfer request slice 0
}
//---------------------------------------------------------------
// 16-Bit-Comparewert einstellen, der den Tastgrad des PWM-Singals verändert
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...50000, Tastgrad 50% bei compare = 25000
//---------------------------------------------------------------
void pwm1_duty_cycle (uint16_t compare)
{
	CCU40_CC40->CRS = compare; 	// Compare Wert, hier 1:1 Imp
	CCU40->GCSS |= 1; 					// Shadow transfer request slice 0
}
//---------------------------------------------------------------
// 8-Bit-Comparewert (für Tastgrad) und Periodendauer der 8-Bit-PWM1 P0.6 einstellen
// compare = 0...period, period = 0...255
// Tastgrad 50% bei compare = period/2
//---------------------------------------------------------------
void pwm1_duty_cycle_period_8 (uint8_t compare, uint8_t periode)
{
	CCU40_CC40->PRS = periode*10; 			// Period Register set , ca. 1.5 kHz bei periode = 255
	CCU40_CC40->CRS = (periode - compare)*10;// Compare Wert
	CCU40->GCSS |= 1; 						//Shadow transfer request slice 0
}
//---------------------------------------------------------------
// 16-Bit-Comparewert (für Tastgrad) und Periodendauer der PWM1 P0.6 einstellen
// Vorteiler max 15
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...period, period = 0...50000
// Tastgrad 50% bei compare = period/2
//---------------------------------------------------------------
void pwm1_duty_cycle_period (uint8_t vorteiler, uint16_t compare, uint16_t periode)
{
	vorteiler %= 0x10;				// max. 15
	CCU40_CC40->PSC = vorteiler;
	CCU40_CC40->PRS = periode; 		// Period Register set, ca. 640 Hz bei periode = 50000
	CCU40_CC40->CRS = compare;		// Compare Wert
	CCU40->GCSS |= 1; 				// Shadow transfer request slice 0
}
//---------------------------------------------------------------
// 8-Bit-Comparewert einstellen, der den Tastgrad des 8-Bit-PWM-Singals verändert
// compare = 0...255, Tastgrad 50% bei compare = 127
//---------------------------------------------------------------
void pwm2_duty_cycle_8 (uint8_t compare)
{
	CCU40_CC41->CRS = periode_pwm_8 - (compare * 10);// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1<<4; 				//Shadow transfer request slice 1
}
//---------------------------------------------------------------
// 16-Bit-Comparewert einstellen, der den Tastgrad des PWM-Singals verändert
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...50000, Tastgrad 50% bei compare = 25000
//---------------------------------------------------------------
void pwm2_duty_cycle (uint16_t compare)
{
	CCU40_CC41->CRS = compare;	// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1<<4; 				// Shadow transfer request slice 1
}
//---------------------------------------------------------------
// 8-Bit-Comparewert (für Tastgrad) und Periodendauer der 8-Bit-PWM2 P0.7 einstellen
// compare = 0...periode, periode = 0...255
// Tastgrad 50% bei compare = periode/2
//---------------------------------------------------------------
void pwm2_duty_cycle_period_8 (uint8_t compare, uint8_t periode)
{
	CCU40_CC41->PRS = periode*10; 			// Period Register set , ca. 1.5 kHz bei periode = 255
	CCU40_CC41->CRS = (periode - compare)*10;// Compare Wert
	CCU40->GCSS |= 1<<4; 				//Shadow transfer request slice 1
}
//---------------------------------------------------------------
// 16-Bit-Comparewert (für Tastgrad) und Periodendauer der PWM2 P0.7 einstellen
// Vorteiler max 15
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...period, period = 0...50000
// Tastgrad 50% bei compare = periode/2
//---------------------------------------------------------------
void pwm2_duty_cycle_period (uint8_t vorteiler, uint16_t compare, uint16_t periode)
{
	vorteiler %= 0x10;					// max. 15
	CCU40_CC41->PSC = vorteiler;
	CCU40_CC41->PRS = periode; 			// Period Register set, ca. 640 Hz bei periode = 50000
	CCU40_CC41->CRS = compare;			// Compare Wert
	CCU40->GCSS |= 1<<4; 				// Shadow transfer request slice 1
}
//---------------------------------------------------------------
// 8-Bit-Comparewert einstellen, der den Tastgrad des 8-Bit-PWM-Singals verändert
// compare = 0...255, Tastgrad 50% bei compare = 127
//---------------------------------------------------------------
void pwm3_duty_cycle_8 (uint8_t compare)
{
	CCU40_CC42->CRS = periode_pwm_8 - (compare * 10);// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1<<8; 				//Shadow transfer request slice 2
}
//---------------------------------------------------------------
// 16-Bit-Comparewert einstellen, der den Tastgrad des PWM-Singals verändert
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...50000, Tastgrad 50% bei compare = 25000
//---------------------------------------------------------------
void pwm3_duty_cycle (uint16_t compare)
{
	CCU40_CC42->CRS = compare;	// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1<<8; 				// Shadow transfer request slice 2
}
//---------------------------------------------------------------
// 8-Bit-Comparewert (für Tastgrad) und Periodendauer der 8-Bit-PWM3 P0.8 einstellen
// compare = 0...periode, periode = 0...255
// Tastgrad 50% bei compare = periode/2
//---------------------------------------------------------------
void pwm3_duty_cycle_period_8 (uint8_t compare, uint8_t periode)
{
	CCU40_CC42->PRS = periode*10; 			// Period Register set , ca. 1.5 kHz bei periode = 255
	CCU40_CC42->CRS = (periode - compare)*10;// Compare Wert
	CCU40->GCSS |= 1<<8; 				//Shadow transfer request slice 2
}
//---------------------------------------------------------------
// 16-Bit-Comparewert (für Tastgrad) und Periodendauer der PWM3 P0.8 einstellen
// Vorteiler max 15
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...period, period = 0...50000
// Tastgrad 50% bei compare = periode/2
//---------------------------------------------------------------
void pwm3_duty_cycle_period (uint8_t vorteiler, uint16_t compare, uint16_t periode)
{
	vorteiler %= 0x10;					// max. 15
	CCU40_CC42->PSC = vorteiler;
	CCU40_CC42->PRS = periode; 			// Period Register set, ca. 640 Hz bei periode = 50000
	CCU40_CC42->CRS = compare;			// Compare Wert
	CCU40->GCSS |= 1<<8; 				// Shadow transfer request slice 2
}
//---------------------------------------------------------------
// 16-Bit-Comparewert einstellen, der den Tastgrad des PWM-Singals verändert
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...50000, Tastgrad 50% bei compare = 25000
//---------------------------------------------------------------
void pwm4_duty_cycle (uint16_t compare)
{
	CCU40_CC43->CRS = compare;	// Compare Wert,hier 1:1 Imp
	CCU40->GCSS |= 1<<12; 				// Shadow transfer request slice 2
}
//---------------------------------------------------------------
// 16-Bit-Comparewert (für Tastgrad) und Periodendauer der PWM3 P0.9 einstellen
// Vorteiler max 15
// eingestellte Periodendauer bei #define periode_pwm 50000
// compare = 0...period, period = 0...50000
// Tastgrad 50% bei compare = periode/2
//---------------------------------------------------------------
void pwm4_duty_cycle_period (uint8_t vorteiler, uint16_t compare, uint16_t periode)
{
	vorteiler %= 0x10;					// max. 15
	CCU40_CC43->PSC = vorteiler;
	CCU40_CC43->PRS = periode; 			// Period Register set, ca. 640 Hz bei periode = 50000
	CCU40_CC43->CRS = compare;			// Compare Wert
	CCU40->GCSS |= 1<<12; 				// Shadow transfer request slice 2
}
//----------------------------------------------------------------
// PWM1-Ausgang P0.6 Ausgabe starten ohne Interrupt starten, 8- oder 16-Bit
//----------------------------------------------------------------
void pwm1_start(void)
{
	 CCU40_CC40->TCSET = 0x1; //starts counting
}
/*------------------------------------------------------------------
* PWM1-Ausgang P0.6 Ausgabe starten mit Interrupt nach jeder Periode
* Diese Timer-ISR ins eigene Programm kopieren
void CCU40_0_IRQHandler (void)
{
	pwm1_duty_cycle (uint8_t compare); // neuen Comparewert laden
}
*/
void pwm1_start_interrupt(void)
{
	CCU40_CC40->TCSET = 0x1; 		//starts counting
	// Int bei Periode CCU42_CC40 :
	CCU40_CC40->INTE |=1 ;			//Int bei Period Match_
	NVIC_EnableIRQ(CCU40_0_IRQn); 	// Int Freigabe für CCU40 => CC40
}
//----------------------------------------------------------------
// PWM2-Ausgang P0.7 Ausgabe starten ohne Interrupt starten
//----------------------------------------------------------------
void pwm2_start(void)
{
	 CCU40_CC41->TCSET = 0x1; //starts counting
}
/*------------------------------------------------------------------
* PWM2-Ausgang P0.7 Ausgabe starten mit Interrupt nach jeder Periode
* Diese Timer-ISR ins eigene Programm kopieren
void CCU40_1_IRQHandler (void)
{
	pwm2_duty_cycle (uint8_t compare); // neuen Comparewert laden
}
*/
void pwm2_start_interrupt(void)
{
	CCU40_CC41->TCSET = 0x1; 		//starts counting
	// Int bei Periode CCU42_CC41 :
	CCU40_CC41->INTE |=1 ;			//Int bei Period Match_
	NVIC_EnableIRQ(CCU40_1_IRQn); 	// Int Freigabe für CCU40 => CC41
}
//----------------------------------------------------------------
// PWM3-Ausgang P0.8 Ausgabe starten ohne Interrupt starten
//----------------------------------------------------------------
void pwm3_start(void)
{
	 CCU40_CC42->TCSET = 0x1; //starts counting
}
/*------------------------------------------------------------------
* PWM3-Ausgang P0.8 Ausgabe starten mit Interrupt nach jeder Periode
* Diese Timer-ISR ins eigene Programm kopieren
void CCU40_2_IRQHandler (void)
{
	pwm3_duty_cycle (uint8_t compare); // neuen Comparewert laden
}
*/
void pwm3_start_interrupt(void)
{
	CCU40_CC42->TCSET = 0x1; 		//starts counting
	// Int bei Periode CCU42_CC42 :
	CCU40_CC42->INTE |=1 ;			//Int bei Period Match_
	NVIC_EnableIRQ(CCU40_2_IRQn); 	// Int Freigabe für CCU40 => CC42
}
//----------------------------------------------------------------
// PWM4-Ausgang P0.9 Ausgabe starten ohne Interrupt starten
//----------------------------------------------------------------
void pwm4_start(void)
{
	 CCU40_CC43->TCSET = 0x1; //starts counting
}
/*------------------------------------------------------------------
* PWM4-Ausgang P0.9 Ausgabe starten mit Interrupt nach jeder Periode
* Diese Timer-ISR ins eigene Programm kopieren
void CCU40_3_IRQHandler (void)
{
	pwm4_duty_cycle (uint8_t compare); // neuen Comparewert laden
}
*/
void pwm4_start_interrupt(void)
{
	CCU40_CC43->TCSET = 0x1; 		//starts counting
	// Int bei Periode CCU40_CC43 :
	CCU40_CC43->INTE |=1 ;			//Int bei Period Match_
	NVIC_EnableIRQ(CCU40_3_IRQn); 	// Int Freigabe für CCU40 => CC43
}
// PWM1 anhalten -----------------------------------------------------
void pwm1_stop(void)
{
	CCU40_CC40->TCCLR = 0x01;
	NVIC_DisableIRQ(CCU40_0_IRQn); 	// Int sperren für CCU40 => CC40
}
// PWM2 anhalten -----------------------------------------------------
void pwm2_stop(void)
{
	CCU40_CC41->TCCLR = 0x01;
	NVIC_DisableIRQ(CCU40_1_IRQn); 	// Int sperren für CCU40 => CC41
}
// PWM3 anhalten -----------------------------------------------------
void pwm3_stop(void)
{
	CCU40_CC42->TCCLR = 0x01;
	NVIC_DisableIRQ(CCU40_2_IRQn); 	// Int sperren für CCU40 => CC42
}
// PWM4 anhalten -----------------------------------------------------
void pwm4_stop(void)
{
	CCU40_CC43->TCCLR = 0x01;
	NVIC_DisableIRQ(CCU40_3_IRQn); 	// Int sperren für CCU40 => CC43
}


// ab hier ADC-Funktionen ****************************************

//---------------------------------------------------------------
// Analog-Digital-Converter initialisieren
//---------------------------------------------------------------
void adc_init(void)
{
	PORT2->IOCR4 = PORT2->IOCR4 & 0x00000000;	// P2 => INPUT
	SCU_GENERAL->PASSWD = 0x000000C0UL;			// Modul write enable
	SCU_CLK->CGATCLR0 |= 0x00000001; 			// disable  VADC gating
	while (( SCU_CLK->CLKCR)& 0x40000000);		// wait for stabilize
	SCU_GENERAL->PASSWD = 0x000000C3UL;
	CLR_BIT(VADC->CLC,0); 						// Clock Enable

