2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
	SHS0->SHSCFG = 0x00008000 ; 				// SCWC Bit = 1
	//SET_BIT (SHS0->SHSCFG,15); => geht nicht !!
	CLR_BIT (SHS0->SHSCFG,12);  				// ANOFF = 0
	SET_BIT (SHS0->SHSCFG,11); 					// int. Uref
	*((int*)0x40010500)= 0x01;					// Toggle on => workarond
	//VADC_Start = 0x00000001;					// Zusatz Bit für Start
	while ( (SHS0->SHSCFG & 0x00004000) == 0);	// Warte auf ready
    //--------------Kalibrierung
	 // VADC->GLOBCFG &= ~VADC_GLOBCFG_DPCAL0_Msk;    // Enable post-calibration.
	  // workaround for calibration
	  VADC->GLOBCFG |= VADC_GLOBCFG_DPCAL0_Msk;
	  VADC->GLOBCFG |= VADC_GLOBCFG_DPCAL1_Msk;
	  VADC->GLOBCFG &= ~VADC_GLOBCFG_SUCAL_Msk;      // Raising edge on SUCAL to initiate the calibration.
	  VADC->GLOBCFG |= VADC_GLOBCFG_SUCAL_Msk;
	  // workaround for calibration
	  VADC->GLOBCFG |= VADC_GLOBCFG_DPCAL0_Msk;
	  VADC->GLOBCFG |= VADC_GLOBCFG_DPCAL1_Msk;
	  while ((SHS0->SHSCFG & SHS_SHSCFG_STATE_Msk) != 0);  // Wait until calibration is finished.
	  *((int*)0x480340E0) = 0x80008000;
	  *((int*)0x480340E4) = 0x80008000;
	//--------------Ende Kalibrierung
	SET_BIT (VADC->BRSMR,0);					// Conv Request => pending Bit
	VADC->BRSCTRL = 0x00000000;					// kein ext. Trigger
	SET_BIT(VADC->BRSSEL[0],0)  ;				// Kanal 0
}

//---------------------------------------------------------------
// 12-Bit-Wert vom Analogeingang einlesen
// Kanal 0: Poti links, 1: Poti rechts, 2: P2.9, 3: P2.10, 4: P2.11, 7: P2.2
//---------------------------------------------------------------
uint16_t adc_in(uint8_t kanal)

{
	kanal %=7;									// max Kanal 7
	VADC->BRSPND[0]  = 1 << kanal;				// Pending Kanal 0.. 8
	while ((VADC->GLOBRES & 0x80000000) == 0 );	// Abfrage VF Bit
	CLR_BIT(VADC->GLOBRES,31);					// Clear VF Bit
	return (VADC->GLOBRES & 0x00000fff);		// 12 Bit Ergebnis
}
// Delays ********************************************************
//---------------------------------------------------------------
void delay_10us (uint8_t n)
{
	volatile uint16_t z;
	for (;n != 0;--n)
			for (z = 10; 	z!= 0; 	--z); // 10 zu lang, 9 zu kurz
}
//---------------------------------------------------------------
// Zeitverzögerung n mal 100µs
//---------------------------------------------------------------
void delay_100us (uint8_t n)
{
	volatile uint16_t z;
	for (;n != 0;--n)
		for (z = _T_CONST_; 	z!= 0; 	--z);
}

//---------------------------------------------------------------
// Zeitverzögerung Millisekunden
//---------------------------------------------------------------
void delay_ms( uint16_t millisekunden)
{
	volatile uint16_t n = 0;

	while(n < millisekunden)
	{
		delay_100us(10);
		n++;
	}
}

//void delay_s(uint16_t sekunden)
//{
//	volatile uint16_t n = 0;
//
//	while(n < sekunden)
//	{
//		delay_ms(1000);
//		n++;
//	}
//}

// ****************************************************************************
// I2C- Routinen zur Ansteuerung eins I2C-Slaves
// I2C-Bus-Funktionen i2c_init, i2c_start, i2c_stop, i2c_write, i2c_read
// ****************************************************************************

//---------------------------------------------------------------
// **** Zeitverzoegerung zur Verlangsamung der Datenuebertragungsrate ***********
// **** i=2 bis i=100 waehlen je nach I2C-IC und Pull-Up-Widerstand
//---------------------------------------------------------------
void i2c_delay(void)
//---------------------------------------------------------------
{
  volatile uint8_t i;	         // i nicht rausoptimieren (volatile)!!
  for (i=10;i!=0;i--);
}

//---------------------------------------------------------------
// Initialiserung I2C-Bus
// SDA P1.0, SCL P1.1
//---------------------------------------------------------------
void i2c_init (void)
{
  I2C_DIR |= SDA_OUT; 			// SDA => Pn.0
  I2C_DIR |= SCL_OUT;			//SCL => OUT
  I2C_PORT_OUT |= (1<<SDA);   	// Leitungen in den Grundzustand High
  i2c_delay();
  I2C_PORT_OUT |= (1<<SCL);
  i2c_delay();
}

//---------------------------------------------------------------
// Startbedingung I2C-Bus
//---------------------------------------------------------------
void i2c_start (void)
{
  I2C_DIR |= SDA_OUT;			// Richtung => OUT
  I2C_DIR |= SCL_OUT;			// Richtung => OUT
  I2C_PORT_OUT |= (1<<SDA);     // Grundzustand
  I2C_PORT_OUT |= (1<<SCL);
  i2c_delay();
  I2C_PORT_OUT &= ~(1<<SDA);    // Wechsel SDA von 1 -> 0 w�hrend SCL = 1
  i2c_delay();
  //I2C_PORT_OUT &= ~(1<<SCL);
  //i2c_delay();
}

//---------------------------------------------------------------
// Stoppbedingung I2C-Bus
//---------------------------------------------------------------
void i2c_stop (void)
{
	I2C_DIR |= SDA_OUT;	// Richtung => OUT
	I2C_DIR |= SCL_OUT;	// Richtung => OUT
	I2C_PORT_OUT &= ~(1<<SDA);                 // SDA = 4;
	I2C_PORT_OUT |= (1<<SCL);                  // SCL = 5;
	i2c_delay();
  // Wechsel von SDA 0 -> 1 w�hrend SCL = 1
	I2C_PORT_OUT |= (1<<SDA);                  // SDA = 4;
	i2c_delay();
}

//---------------------------------------------------------------
// Byte ausgeben an I2C-Bus , Rueckgabewert = ack = ACK/NACK
//---------------------------------------------------------------
uint8_t i2c_write (uint8_t value)
{
  uint8_t z;                             // Zaehler
  uint8_t ack;                           // Acknowledge-Bit

    I2C_DIR |= SDA_OUT;					// Richtung => OUT
    I2C_DIR |= SCL_OUT;					// Richtung => OUT

  for (z = 8; z != 0; z --)              // Zaehler: serielle Ausgabe von 8 Bit
  {
	  I2C_PORT_OUT &= ~(1<<SCL);         // SCL = 0  Clockausgabe
	  // Daten:
	  if ((value & 0x80) == 0x80)        // Ausgabe: MSB first
		  I2C_PORT_OUT |= (1<<SDA);      // SDA = 1;
	  else
		  I2C_PORT_OUT &= ~(1<<SDA);     // SDA = 0;
	  value <<=1;                  // naechstes Bit!

	  i2c_delay();
	  I2C_PORT_OUT |= (1<<SCL);          // SCL = 1
    i2c_delay();
  }
  //I2C_DIR &= SDA_IN;					// Data auf Input hier ist es zu früh, wenn LSB 0 war
  I2C_PORT_OUT &= ~(1<<SCL);    // SCL = 0 Datenausabe
  I2C_DIR &= SDA_IN;						// Data auf Input

  i2c_delay();
  I2C_PORT_OUT |= (1<<SCL);              // SCL = 1 Slave kann best�tigen
  i2c_delay();                           // warten

  ack = (I2C_PORT_IN & (1<<SDA))>>SDA;

  i2c_delay();
  I2C_PORT_OUT &= ~(1<<SCL);             // SCL = 0 Slave soll Ackn-Ausgabe beenden
  i2c_delay();

  return ack;                            // Acknoledge-Bit ist R�ckgabewert der Funktion
                                         // ack = 0 bedeutet Slave hat "verstanden" !!!!!!
}
//---------------------------------------------------------------
// Byte einlesen vom I2C-Bus.
//---------------------------------------------------------------
uint8_t i2c_read (uint8_t ack)
{
  uint8_t z, value = 0;
  I2C_DIR &= SDA_IN;			// Data auf Input


  for (z = 8; z != 0; z--)      // Z�hler: serielles Einlesen von 8 Bit
  {
    I2C_PORT_OUT |= (1<<SCL);       // SCL = 1  Daten sind g�ltig
    i2c_delay();

    value <<= 1;
    value |= (uint8_t) ((I2C_PORT_IN & (1<<SDA))>>SDA);    //SDA   Datenbit in Puffer

    i2c_delay();
    I2C_PORT_OUT &= ~(1<<SCL);                // SCL = 0  Daten lesen beendet
    i2c_delay();
  }
  I2C_DIR |= SDA_OUT;	// Richtung => OUT
  if (ack == ACK)  I2C_PORT_OUT &= ~(1<<SDA); // SDA = 0  (= Acknowledge)
  else             I2C_PORT_OUT |= (1<<SDA);  // SDA = 1  (= Not Acknowledge)

  i2c_delay();
  I2C_PORT_OUT |= (1<<SCL);                   // SCL = 1  Ackn. g�ltig
  i2c_delay();
  I2C_PORT_OUT &= ~(1<<SCL);                  // SCL = 0  Ackn. beendet
  i2c_delay();
  I2C_PORT_OUT &= ~(1<<SDA);                  // SDA = 0  Leitung SDA vorbereiten f�r Stoppbed.
  i2c_delay();

  return ( value );                       // eingelesenes Byte = R�ckgabewert
}

// ****************************************************************************
// RS232-Routinen zur Kommunikation mit PC-Terminal
// ****************************************************************************
// RxD auf P1.3 , XMC1100 TxD auf P1.2
// values calculated for 9.6 kbaud @ 32 MHz
// Baudrate = 32 MHz * Step/1024 * 1/(PDIV +1)  * 1/ (PCTQ +1) * 1/ (DCTQ +1)
//#define FDR_STEP	25	// fuer 9.6 kBaud
//#define BRG_PDIV	4
//#define BRG_DCTQ	15
//#define BRG_PCTQ	0
#define FDR_STEP	118
#define BRG_PDIV	23  //9600  11=>19,2k  5=>38,4k  3=>57,6k  1=>115,2k
#define BRG_DCTQ	15
#define BRG_PCTQ	0

/* USIC : FIFO DPTR & SIZE MASK and POS Values */
#define   USIC_CH_TBCTR_DPTRSIZE_Pos  	(0U)
#define   USIC_CH_TBCTR_DPTRSIZE_Msk  	(0x0700003FU << USIC_CH_TBCTR_DPTRSIZE_Pos)

