2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
}
//---------------------------------------------------------------
// schreibt eine nullterminierte Zeichenfolge auf COM
//---------------------------------------------------------------
void rs232_print ( char *text )
{
  while (*text != '\0')
    rs232_put(*text++);
}

/*------------------------------------------------------------------
* Bei jedem empfangenen Zeichen wird diese Interrupt Service Routine aktiviert
* Diese USIC-ISR kann ins eigene Programm kopiert werden dann muss diese
* Variante auskommentiert werden.
* Diese ISR arbeitet mit folgende Funktionen:
* rs232_wait_of_enter(), rs232_clear_receivedata()
* Es werden folgende globale Variablen benötigt:
* rs232Receivedata, rs232ReceivedataPointer, rs232EnterReceive
*/
void USIC0_0_IRQHandler(void)
{
	char temp=USIC0_CH1->RBUF & 0xff;	// Rx-Buffer auslesen
	if (temp == '\r') {					// Enterzeichen empfangen?
		rs232Receivedata[rs232ReceivedataPointer]='\0';
		rs232EnterReceive = 1;
	} else {
		rs232Receivedata[rs232ReceivedataPointer]=temp;
	}
	rs232ReceivedataPointer++;
	return;
}
void rs232_wait_of_enter()
{
	while (rs232EnterReceive==0) {}
	rs232EnterReceive=0;
}
void rs232_clear_receivedata()
{
	rs232Receivedata[0]='\0';
	rs232ReceivedataPointer=0;
}

uint8_t rs232_read_number()
{
	uint8_t stellen, zahl=0;

	rs232_wait_of_enter();
	for (stellen=0; rs232Receivedata[stellen] != '\0'; stellen++);

	for(uint8_t i=0;stellen >0; stellen--,i++) {
			zahl=rs232Receivedata[i] - 0x30 + zahl * 10;
	}
	return zahl;
}
int rs232_read_int_number()
{
	uint8_t stellen;
	int zahl=0;

	rs232_wait_of_enter();
	for (stellen=0; rs232Receivedata[stellen] != '\0'; stellen++);

	for(uint8_t i=0;stellen >0; stellen--,i++) {
			zahl=rs232Receivedata[i] - 0x30 + zahl * 10;
	}
	return zahl;
}
void rs232_print_number(uint8_t zahl)
{
	uint8_t rest, stellen=1;
	char string[20];

	for (rest=zahl; (rest=rest/10) > 0; stellen++);

	string[stellen] = '\0';

	for (; stellen > 0; stellen--) {
		rest=zahl % 10;
		zahl=zahl / 10;
		string[stellen-1]=rest + 0x30;
	}
	rs232_print(string);
}
void rs232_print_int_number(int zahl)
{
	uint8_t stellen=1;
	int rest;
	char string[20];

	for (rest=zahl; (rest=rest/10) > 0; stellen++);

	string[stellen] = '\0';

	for (; stellen > 0; stellen--) {
		rest=zahl % 10;
		zahl=zahl / 10;
		string[stellen-1]=rest + 0x30;
	}
	rs232_print(string);
}
// ****************************************************************************
// UART-Routinen zur Kommunikation mit PC-Terminal
// ****************************************************************************
// RxD auf P0.6 , XMC1100 TxD auf P0.7
// values calculated for 9.6 kbaud @ 32 MHz
// Baudrate = 32 MHz * Step/1024 * 1/(PDIV +1)  * 1/ (PCTQ +1) * 1/ (DCTQ +1)
//#define FDR_STEP_UART	25	// fuer 9.6 kBaud
//#define BRG_PDIV_UART	4
//#define BRG_DCTQ_UART	15
//#define BRG_PCTQ_UART	0

#define FDR_STEP_UART	118
#define BRG_PDIV_UART	23 //9600  11=>19,2k  5=>38,4k  3=>57,6k  1=>115,2k
#define BRG_DCTQ_UART	15
#define BRG_PCTQ_UART	0

// USIC : FIFO DPTR & SIZE MASK and POS Values
#define   USIC_CH_TBCTR_DPTRSIZE_Pos_UART  	(0U)
#define   USIC_CH_TBCTR_DPTRSIZE_Msk_UART  	(0x0700003FU << USIC_CH_TBCTR_DPTRSIZE_Pos_UART)

#define   USIC_CH_RBCTR_DPTRSIZE_Pos_UART  	(0U)
#define   USIC_CH_RBCTR_DPTRSIZE_Msk_UART  	(0x0700003FU << USIC_CH_RBCTR_DPTRSIZE_Pos_UART)

//---------------------------------------------------------------
// Serielle Schnittstelle initialisieren
// RxD auf P1.1 0.6, TxD auf P1.0 0.7, 9600 Baud, 8N1
//---------------------------------------------------------------
void uart_init ( void )
{	//USIC0 Cannel 0 wird verwendet:
	SCU_GENERAL->PASSWD = 0x000000C0UL;
	SCU_CLK->CGATCLR0 |= 0x00000008;		// stop gating USIC
		while((SCU_CLK->CLKCR)&0x40000000UL);	// wait for VDDC to stabilize
	SCU_GENERAL->PASSWD = 0x000000C3UL;

	USIC0_CH0->KSCFG |= 3UL ;	//  Mode enable + Freigabe write
	//WR_REG(USIC0_CH1->FDR, USIC_CH_FDR_DM_Msk, USIC_CH_FDR_DM_Pos, 2);
	USIC0_CH0->FDR |= 1UL << 15 ;	//Fractional divider mode selected
		//Step value
	USIC0_CH0->FDR|= FDR_STEP_UART;
		//Vorteiler:
		// Baudrate = 32 MHz * Step/1024 * 1/(PDIV +1)  * 1/ (PCTQ +1) * 1/ (DCTQ +1)
	USIC0_CH0->BRG |= (BRG_PDIV_UART << 16) ;
	USIC0_CH0->BRG |= BRG_DCTQ_UART << 10 ;
	USIC0_CH0->BRG |= BRG_PCTQ_UART << 8 ;

		//Configuration of USIC Shift Control
		//Transmit/Receive LSB first is selected, Transmission Mode (TRM) = 1, Passive Data Level (PDL) = 1
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_PDL_Msk, USIC_CH_SCTR_PDL_Pos, 1);
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_TRM_Msk, USIC_CH_SCTR_TRM_Pos, 1);
		//Set Word Length (WLE) & Frame Length (FLE)
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_FLE_Msk, USIC_CH_SCTR_FLE_Pos, 7);
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_WLE_Msk, USIC_CH_SCTR_WLE_Pos, 7);

		//Configuration of USIC Transmit Control/Status Register
		//TBUF Data Enable (TDEN) = 1, TBUF Data Single Shot Mode (TDSSM) = 1
	WR_REG(USIC0_CH0->TCSR, USIC_CH_TCSR_TDEN_Msk, USIC_CH_TCSR_TDEN_Pos, 1);
	WR_REG(USIC0_CH0->TCSR, USIC_CH_TCSR_TDSSM_Msk, USIC_CH_TCSR_TDSSM_Pos, 1);

		//Configuration of Protocol Control Register
		//Sample Mode (SMD) = 1, 1 Stop bit is selected, Sample Point (SP) = 2, Pulse Length (PL) = 0
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_SMD_Msk,
				USIC_CH_PCR_ASCMode_SMD_Pos, 1);
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_STPB_Msk, USIC_CH_PCR_ASCMode_STPB_Pos, 0);
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_SP_Msk, USIC_CH_PCR_ASCMode_SP_Pos, 9);
		//TBIF is set to simplify polling
	WR_REG(USIC0_CH0->PSR_ASCMode, USIC_CH_PSR_TBIF_Msk, USIC_CH_PSR_TBIF_Pos, 1);
		//Configuration of Transmitter Buffer Control Register
	WR_REG(USIC0_CH0->TBCTR, USIC_CH_TBCTR_LIMIT_Msk, USIC_CH_TBCTR_LIMIT_Pos, 0);

		//Configuration of Channel Control Register
		//parity generation is disabled
	USIC0_CH0->CCR |=  0x02;	// ASC Mode

		//Data Pointer & Buffer Size for Transmitter Buffer Control - DPTR = 64,  SIZE = 6
	WR_REG(USIC0_CH0->TBCTR, USIC_CH_TBCTR_DPTRSIZE_Msk_UART, USIC_CH_TBCTR_DPTRSIZE_Pos_UART, 0x06000040);

