2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
	// Rx Pin: P1.1
	bit_init(P1,1,INP); //P1.1 als Eingang definieren
	USIC0_CH0->DX0CR &= ~(0x7);	// Kanal: USIC0_CH0 => DX0D auf P1.1 ( siehe Pin Mapping)
	USIC0_CH0->DX0CR |= 3;

	//Tx Pin P1.0
	PORT1->IOCR0 &= 0xffffff07;	// P1.0
	PORT1->IOCR0  |= 0x000000B8; // ALT 7 fuer P1.0 => TxD d.h. XMC1100 sendet auf P1.0

	//UART Channel Auswahl auf DCE
	bit_init(0,12,OUTP);
	bit_write(0,12,1);
	bit_init(0,13,OUTP);
	bit_write(0,13,1);
}

//Initialisierung mit waehlbare Baudrate
void uart_init_bd(int bd)
{	//USIC0 Cannel 0 wird verwendet:
	uint8_t brgPdivUART=1;

	SCU_GENERAL->PASSWD = 0x000000C0UL;
	SCU_CLK->CGATCLR0 |= 0x00000008;		// stop gating USIC
		while((SCU_CLK->CLKCR)&0x40000000UL);	// wait for VDDC to stabilize
	SCU_GENERAL->PASSWD = 0x000000C3UL;

	USIC0_CH0->KSCFG |= 3UL ;	//  Mode enable + Freigabe write
	//WR_REG(USIC0_CH1->FDR, USIC_CH_FDR_DM_Msk, USIC_CH_FDR_DM_Pos, 2);
	USIC0_CH0->FDR |= 1UL << 15 ;	//Fractional divider mode selected
		//Step value
	USIC0_CH0->FDR|= FDR_STEP_UART;
		//Vorteiler:
		// Baudrate = 32 MHz * Step/1024 * 1/(PDIV +1)  * 1/ (PCTQ +1) * 1/ (DCTQ +1)
	USIC0_CH0->BRG &=0xFC00FFFF;  //Pdiv loeschen
	if (bd == 115200)  brgPdivUART=1;
	else if (bd == 57600) brgPdivUART=3;
	else if (bd == 38400) brgPdivUART=5;
	else if (bd == 19200) brgPdivUART=11;
	else brgPdivUART=23; //if (bd == 9600)
	USIC0_CH0->BRG |= (brgPdivUART << 16) ;
	USIC0_CH0->BRG |= BRG_DCTQ_UART << 10 ;
	USIC0_CH0->BRG |= BRG_PCTQ_UART << 8 ;

		//Configuration of USIC Shift Control
		//Transmit/Receive LSB first is selected, Transmission Mode (TRM) = 1, Passive Data Level (PDL) = 1
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_PDL_Msk, USIC_CH_SCTR_PDL_Pos, 1);
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_TRM_Msk, USIC_CH_SCTR_TRM_Pos, 1);
		//Set Word Length (WLE) & Frame Length (FLE)
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_FLE_Msk, USIC_CH_SCTR_FLE_Pos, 7);
	WR_REG(USIC0_CH0->SCTR, USIC_CH_SCTR_WLE_Msk, USIC_CH_SCTR_WLE_Pos, 7);

		//Configuration of USIC Transmit Control/Status Register
		//TBUF Data Enable (TDEN) = 1, TBUF Data Single Shot Mode (TDSSM) = 1
	WR_REG(USIC0_CH0->TCSR, USIC_CH_TCSR_TDEN_Msk, USIC_CH_TCSR_TDEN_Pos, 1);
	WR_REG(USIC0_CH0->TCSR, USIC_CH_TCSR_TDSSM_Msk, USIC_CH_TCSR_TDSSM_Pos, 1);

		//Configuration of Protocol Control Register
		//Sample Mode (SMD) = 1, 1 Stop bit is selected, Sample Point (SP) = 2, Pulse Length (PL) = 0
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_SMD_Msk,
				USIC_CH_PCR_ASCMode_SMD_Pos, 1);
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_STPB_Msk, USIC_CH_PCR_ASCMode_STPB_Pos, 0);
	WR_REG(USIC0_CH0->PCR_ASCMode, USIC_CH_PCR_ASCMode_SP_Msk, USIC_CH_PCR_ASCMode_SP_Pos, 9);
		//TBIF is set to simplify polling
	WR_REG(USIC0_CH0->PSR_ASCMode, USIC_CH_PSR_TBIF_Msk, USIC_CH_PSR_TBIF_Pos, 1);
		//Configuration of Transmitter Buffer Control Register
	WR_REG(USIC0_CH0->TBCTR, USIC_CH_TBCTR_LIMIT_Msk, USIC_CH_TBCTR_LIMIT_Pos, 0);

		//Configuration of Channel Control Register
		//parity generation is disabled
	USIC0_CH0->CCR |=  0x02;	// ASC Mode

		//Data Pointer & Buffer Size for Transmitter Buffer Control - DPTR = 64,  SIZE = 6
	WR_REG(USIC0_CH0->TBCTR, USIC_CH_TBCTR_DPTRSIZE_Msk_UART, USIC_CH_TBCTR_DPTRSIZE_Pos_UART, 0x06000040);

	// Rx Pin: P1.1
	bit_init(P1,1,INP); //P1.1 als Eingang definieren
	USIC0_CH0->DX0CR &= ~(0x7);	// Kanal: USIC0_CH0 => DX0D auf P1.1 ( siehe Pin Mapping)
	USIC0_CH0->DX0CR |= 3;

	//Tx Pin P1.0
	PORT1->IOCR0 &= 0xffffff07;	// P1.0
	PORT1->IOCR0  |= 0x000000B8; // ALT 7 fuer P1.0 => TxD d.h. XMC1100 sendet auf P1.0

	//UART Channel Auswahl auf DCE
	bit_init(0,12,OUTP);
	bit_write(0,12,1);
	bit_init(0,13,OUTP);
	bit_write(0,13,1);
}


void uart_interrupt_enable()
{
	USIC0_CH0->CCR  |=0x00004000;
	USIC0_CH0->INPR &=0xFFFFF8FF;
	USIC0_CH0->INPR |=0x00000100; // Interrupt wird auf SR1 gelegt
	USIC0_CH0->PSCR |=0x00000400;
	NVIC_EnableIRQ(USIC0_1_IRQn); 	// Int Freigabe  SR1 für empfange Zeichen
	//NVIC_EnableIRQ(10); 	// Int Freigabe  SR0 für empfange Zeichen
}
/*
void USIC0_1_IRQHandler(void)
{
	empfangsdaten[0]=USIC0_CH0->RBUF & 0xff ;	// RX Buffer auslesen
}
*/
//---------------------------------------------------------------
// liest ein Byte (1..255) von COM, liefert 0 wenn kein Zeichen vorhanden
//---------------------------------------------------------------
char uart_get ( void )
{
  uint8_t buffer;
	buffer = 0;
	if ((USIC0_CH0->PSR &(1UL <<14)) != 0)  // wenn Zeichen vorhanden
	 {
		buffer = USIC0_CH0->RBUF & 0xff ;	// RX Buffer auslesen
		USIC0_CH0->PSCR |= 1UL <<14 ;		// Receive Flag löschen
	 }
	return buffer;
}
//-----------------------------------------------------------------
// liefert 1 wenn Zeichen empfangen und 0 wenn kein Zeichen empfangen
//----------------------------------------------------------------
uint8_t uart_char_received (void)
{
	if ((USIC0_CH0->PSR &(1UL <<14)) != 0) return 1; // wenn Zeichen vorhanden
		else return 0;
}
//---------------------------------------------------------------
// wartet auf ein Byte von COM und liest es ein (0..255)
// Achtung! Programm bleibt solange in dieser Funktion, bis ein Zeichen eintrifft!
//---------------------------------------------------------------
char uart_wait_get ( void )
{
  uint8_t buffer;
	while ((USIC0_CH0->PSR &(1UL <<14)) == 0); 	// auf Zeichen warten
	buffer = USIC0_CH0->RBUF & 0xff ;			// RX Buffer auslesen
	USIC0_CH0->PSCR |= 1UL <<14 ;				// Receive Flag löschen
	return buffer;
}
//---------------------------------------------------------------
// schreibt ein Byte auf COM
//---------------------------------------------------------------
void uart_put ( char value )
{
	USIC0_CH0->IN[0] = value;
	while((USIC0_CH0->TRBSR & (1U<< 11))  == 0);  // Warten , bis Transmit Buffer empty

}
//---------------------------------------------------------------
// schreibt eine nullterminierte Zeichenfolge auf COM
//---------------------------------------------------------------
void uart_print ( char *text )
{
  while (*text != '\0')
    uart_put(*text++);
}

/*------------------------------------------------------------------
* Bei jedem empfangenen Zeichen wird diese Interrupt Service Routine aktiviert
* Diese USIC-ISR kann ins eigene Programm kopiert werden dann muss diese
* Variante auskommentiert werden.
* Diese ISR arbeitet mit folgende Funktionen:
* rs232_wait_of_enter(), rs232_clear_receivedata()
* Es werden folgende globale Variablen benötigt:
* rs232Receivedata, rs232ReceivedataPointer, rs232EnterReceive
*/
void USIC0_1_IRQHandler(void)
{
	char temp=USIC0_CH0->RBUF & 0xff;	// Rx-Buffer auslesen
	if (temp == '\r') {					// Enterzeichen empfangen?
		uartReceivedata[uartReceivedataPointer]='\0';
		uartEnterReceive = 1;
	} else {
		uartReceivedata[uartReceivedataPointer]=temp;
	}
	uartReceivedataPointer++;
	//USIC0_CH0->PSCR |=0x00000400;
	return;
}
void uart_wait_of_enter()
{
	while (uartEnterReceive==0) {}
	uartEnterReceive=0;
}
void uart_clear_receivedata()
{
	uartReceivedata[0]='\0';
	uartReceivedataPointer=0;
}

