2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
/*********uart_select_channel ***************************
 * Die Kanäle der UART Schnittstelle werden umgeschaltet
 * UARTCHANNEL_DCE : P0.12=1 und P0.13=1 => Stecker-Ausgang
 * UARTCHANNEL_DTE : P0.12=0 und P0.13=1 => Buchse Ausgang
 * UARTCHANNEL_0 : P0.12=1 und P0.13=0 => TTL Pegel Kanal 0
 * UARTCHANNEL_1 : P0.12=0 und P0.13=0 => TTL Pegel Kanal 1
 */
void uart_select_channel(uint8_t select) {
	while((USIC0_CH0->TRBSR & (1U<< 11))  == 0);  // Warten , bis Transmit Buffer empty
	//delay_ms(2);
	switch (select) {
	  case UARTCHANNEL_DCE:
	    bit_write(0,12,1);
	    bit_write(0,13,1);
	    break;
	  case UARTCHANNEL_DTE:
		bit_write(0,12,0);
		bit_write(0,13,1);
		break;
	  case UARTCHANNEL_1:
	    bit_write(0,12,1);
	    bit_write(0,13,0);
	    break;
	  case UARTCHANNEL_0:
		bit_write(0,12,0);
		bit_write(0,13,0);
		break;
	}
}

uint8_t uart_read_number()
{
	uint8_t stellen, zahl=0;
	uart_wait_of_enter();
	for (stellen=0; uartReceivedata[stellen] != '\0'; stellen++);

	for(uint8_t i=0;stellen >0; stellen--,i++) {
			zahl=uartReceivedata[i] - 0x30 + zahl * 10;
	}
	return zahl;
}

void uart_print_number(uint8_t zahl)
{
	uint8_t rest, stellen=1;
	char string[20];

	for (rest=zahl; (rest=rest/10) > 0; stellen++);

	string[stellen] = '\0';

	for (; stellen > 0; stellen--) {
		rest=zahl % 10;
		zahl=zahl / 10;
		string[stellen-1]=rest + 0x30;
	}
	uart_print(string);
}

uint8_t warte_auf_eingabe(){
  uint8_t eingabeErfolgt=0;

  while (eingabeErfolgt==0) {
	if (uartEnterReceive==1) {
	  eingabeErfolgt=1;
	  uartEnterReceive=0;
	  return UART;
	}
	if (rs232EnterReceive==1) {
	  eingabeErfolgt=1;
	  rs232EnterReceive=0;
	  return RS232;
	}
  }
  return RS232;
}
// ***********************************************************************
// LCD-Funktionen

// Deklaration lokale Funktionen
void send_byte(unsigned char,unsigned char);
uint8_t lcd_lookup(uint8_t ascii);
void lcd_befehl(uint8_t befehl);
void lcd_daten(uint8_t daten);
void lcd_waitwhilebusy(void);
void init_wait(uint16_t n);
void wait_bsy2(void);
void wait_bsy1(void);

// Anschluss des Displays XMC1100  Board an:
#define sclk 0 // sclk = P2.0 => Clock Anschluss LCD
#define sid 1  // sid  = P2.1 => seriell Input LCD
#define sod 0  // sod  =

// Wartezeit-Konstante für Initialisierung und Busy-Abfrage berechnen
#define LCD_WAIT 3 // ca. 7 uSek Takt

//---------------------------------------------------------------
// Sende ein Byte zum Display, senddata ist Bytewert
// rs => Command = 0 und Data = 1
//---------------------------------------------------------------
void send_byte(unsigned char senddata, unsigned char rs)
{
	unsigned char i;
	unsigned long sendwert, zw;
	zw = (unsigned long)senddata;   // Typconvertierung
	sendwert = 0x001f + ((zw & 0xf0)<<12) + ((zw&0x0f)<<8);
	if (rs == 1) sendwert = sendwert + 0x40;
	for (i = 0; i<24;i++)	// serielle Ausgabe von 24Bit
	{  	CLR_BIT (PORT2->OUT,sclk)  ; // clk = 0;
		if ((sendwert & 0x00000001) == 0)  CLR_BIT(PORT2->OUT,sid);  //sid = 0;
		else SET_BIT(PORT2->OUT,sid);
		wait_bsy1();
		SET_BIT ( PORT2->OUT,sclk);	//sclk = 1;
		wait_bsy1();
		sendwert = sendwert >> 1;
	}
}
void wait_bsy2(void)	  // ca. 1.6 ms warten
{
	unsigned int zaehler ;
	for (zaehler = 0; zaehler < 0xaff; zaehler++);
}
void wait_bsy1(void)	// ca. 50 us warten
{
	unsigned int zaehler ;
	for (zaehler = 0; zaehler < LCD_WAIT; zaehler++);
}
//---------------------------------------------------------------
// 	Gibt das Byte 'befehl' als Befehl ans LCD-Display
//  Entweder Busy-Flag des LCD abfragen oder Zeitverzögerung verwenden
//---------------------------------------------------------------
void lcd_befehl (uint8_t befehl)
{
  send_byte(befehl,0);
  wait_bsy1();
}
//---------------------------------------------------------------
// 	Gibt das Byte 'daten' ans LCD-Display im SPI Mode aus.
//---------------------------------------------------------------
void lcd_daten(unsigned char daten)
{
  send_byte(daten,1);
	wait_bsy1();
}
//---------------------------------------------------------------
// Initialisierung des LCD- Displays für den 4-Bit-Modus
//---------------------------------------------------------------
void lcd_init (void)
{	delay_ms(500);				// warten bis LCD-Controller bereit
	PORT2->PDISC &=0xfffffffc;	// P2.0 / P2.1 dig. Fkt
	PORT2->IOCR0 |= 0x8080;	// P2.0 / P2.1 = OUT
	PORT2->IOCR0 &= 0xffff8080;

	wait_bsy2();
	wait_bsy2();
	// LCD Init
	send_byte(0x34,0); 			// 8 Bit Mode
	wait_bsy2();
	send_byte(0x09,0); 			// 4 Zeilen Mode
	wait_bsy2();
	send_byte(0x30,0); 			// 8 Bit Datenläge
	wait_bsy2();
	send_byte(0x0f,0); 			// display ein , Cursor ein
	wait_bsy2();
	send_byte(0x01,0); 			// clear Display
	wait_bsy2();
	send_byte(0x07,0); 			// Cursor autoincremet
	wait_bsy2();
}
//---------------------------------------------------------------
// Display löschen
//---------------------------------------------------------------
void lcd_clear (void)
	{
		lcd_befehl (0x01);
		wait_bsy2();
	  lcd_befehl( 0x0e); // Cursor on
		wait_bsy1();
	}
//---------------------------------------------------------------
// LCD-Cursor auf eine Position setzen: Zeile 1..4, Spalte 1..16 (Displayabhängig)
//---------------------------------------------------------------
void lcd_setcursor (uint8_t zeile, uint8_t spalte)
{
  uint8_t position;
  switch(zeile)
  {
    case 0:  position = ZEILE1; break;
    case 1:  position = ZEILE2; break;
    case 2:  position = ZEILE3; break;
    case 3:  position = ZEILE4; break;
    default: position = ZEILE1; break;
  }

  position += (spalte);

  lcd_befehl ( position | 0x80 );         // 0x80 = Kennung für DD RAM address set
}
//---------------------------------------------------------------
//  Ausgabe eines Zeichens an das LCD-Display
//  Entweder Busy-Flag des LCD abfragen oder Zeitverzögerung verwenden
//---------------------------------------------------------------
void lcd_char (uint8_t zeichen)
{
  zeichen = lcd_lookup(zeichen);    // Umlaute und Sonderzeichen ersetzen!
  if (zeichen != 0xC3)							// ASCII Zeichen 0xC3 wird nicht ausgegeben.
  	lcd_daten(zeichen);
}

//---------------------------------------------------------------
// \0-terminierten Text an das LCD-Display ausgeben.
 //---------------------------------------------------------------
void lcd_print (char *text)
{
  while (*text != '\0')                 // Text
    lcd_char (*text++);                // zeichenweise ausgeben
}

//---------------------------------------------------------------
// Gibt das Byte n als 3 stelligen Dez-Wert aufs  Display.
// Führende Nullen werden zu blank.
//---------------------------------------------------------------
void lcd_byte(uint8_t val)
{
  uint8_t buffer[3];
  uint8_t n = 0;

  do
  {
    buffer[n++] = val%10 + '0';
  } while ((val /= 10) > 0);

  while (n<3)                              // Rest von buffer mit blank füllen
  {
    buffer[n++] = ' ';
  }

  while (n > 0)                            // Ausgabe auf das Display (umgekehrt)
  {
    n--;
    lcd_char(buffer[n]);
  }
}
//---------------------------------------------------------------
// Gibt den Integer n als 5 stelligen Dez-Wert aufs Display.
// Führende Nullen werden zu blank.
//---------------------------------------------------------------
void lcd_int(uint16_t val)
{
  uint8_t buffer[5];
  uint8_t n = 0;

  do
  {
    buffer[n++] = val%10 + '0';
  } while ((val /= 10) > 0);

  while (n<5)                              // Rest von buffer mit blank füllen
  {
    buffer[n++] = ' ';
  }

  while (n > 0)                            // Ausgabe auf das Display (umgekehrt)
  {
    n--;
    lcd_char(buffer[n]);
  }
}

//---------------------------------------------------------------
// Ersetzt ein ASCII-Umlaut durch den entsprechenden Display-Code.
// Da die Umlaute durch 16 Bit Werte übersetzt werden, können ein
// paar ASCII Zeichen vertauscht werden.
// ASCII Zeichen 0xC3 wird nicht ausgegeben.
//---------------------------------------------------------------
uint8_t lcd_lookup(uint8_t ascii)
{
  switch (ascii)
  {
    case 0xb0: return 0xdf; // '°'

    case 0xa4:  return 0x7b;
    case 0xb6:  return 0x7C;
    case 0xbc:  return 0x7E;
    /*
    case 'Ä':  return 0xe1;
    case 'Ö':  return 0xef;
    case 'Ü':  return 0xf5;
    case 'ß':  return 0xe2;
    case 'µ':  return 0xe4;
    case '\\': return 0xa4;
    case '€':  return 0xd3;
*/
  }
  return ascii;
}

