2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
/////////////////////////////////////////////////////////////////////////////////
// Ab hier sind ergänzende Funktionen
/////////////////////////////////////////////////////////////////////////////////
#ifdef LCD_EXTENSION
/***********************************************************************************
 * Pixelweise Definition eigener LCD-Zeichen, Ablegen von max 7 Zeichen im CG-RAM des LCD
 ***********************************************************************************/
void lcd_defchar (uint8_t *PixelTabelle, uint8_t ZeichenNr)
{
  uint8_t z;

  if (ZeichenNr<8)                  // Adr 0 nicht innerhalb eines Textstrings nutzbar!
  lcd_befehl (((ZeichenNr*8) & 0x7F) | 0x40);
  // Adresse der ersten Pixelzeile = 8 x Adresse des fertigen Zeichens im DD Ram
  // Zugriff auf Adresse im CG-RAM (Character Generator) mit  Bit7 = 0, Bit6 = 1
  for (z=0;z<8;z++)
  lcd_char (*(PixelTabelle+z));     // 8 Pixelzeilen ins CR-Ram
  lcd_setcursor (0,0);              // wieder auf DD-Ram-Zugriff umschalten
}

/*************************************************************************
Löschen der Zeilen 1 bis 4 des Displays
Es wird ein Leerstring (16 Byte) auf die Zeile geschrieben
***************************************************************************/
void lcd_clearline(uint8_t zeile)
{
  uint8_t n;

  lcd_setcursor(zeile,0);
  for (n=0; n < LCD_LEN; n++)  lcd_char(' ');
}


#endif

/*************************************************************************
Löschen der Zeilen 1 bis 4 des Displays
Es wird ein Leerstring (16 Byte) auf die Zeile geschrieben
***************************************************************************/
void lcd_clearline(uint8_t zeile)
{
  uint8_t n;

  lcd_setcursor(zeile,0);
  for (n=0; n < LCD_LEN; n++)  lcd_char(' ');
  lcd_setcursor(zeile, 0);
}

//**************************************************************************
// Ab hier Int - Funktionen :
//lokale Fkt :
void ext_interrupt1_init(uint8_t flanke);
void ext_interrupt2_init(uint8_t flanke);


/* --------------------------------------------------------------------------
   Externen Interrupt1 initialisieren, ERU0 Kanal 2B0 -> Eingang P2.10,
   flanke=RE=1 Rising Edge ansteigende Flanke
   flanke=FE=0 Falling Edge abfallende Flanke
   Interrupt-Handler ins eigene Programm kopieren:
void ERU0_2_IRQHandler(void)	// ext. Int an P2.10
	{
								// Interrupt-Servie-Routine
	}
//--------------------------------------------------------------------------*/
void ext_interrupt1_init(uint8_t flanke)
{
	ERU0->EXISEL = 0x00000000;			//Eingang 2B0 auswählen (P2.10)
	if (flanke == FE)
		 ERU0->EXICON[2]=0x00000129;	// PE=1 (Trigger Impuls erzeugen) , FE (auf fallende Flanke reagieren)
	else ERU0->EXICON[2]=0x00000125;	// PE=1 (Trigger Impuls erzeugen) , RE (auf ansteigende Flanke reagieren)
	ERU0->EXOCON[2]= 0x00000010;		// GP=1 , OGU2 wird mit NVIC Request Line verbunden
	//CLR_BIT (PORT2->PDISC,10);			// Port 2.10 auf dig. Input
	bit_init_mode(P2, 10, INP, PULLUP);  // Port 2.10 digital, In, Pullup
	ext_clear_IRQ(IRQ1);						 // ISR Anforderungsbit geloescht
	//NVIC_EnableIRQ(ERU0_2_IRQn); // Interrupt wird freigegeben Kanal 2 (CMSIS Bib)
}


/* --------------------------------------------------------------------------
   Externen Interrupt2 initialisieren,  ERU0 Kanal 3B0 -> Eingang P2.9,
   flanke=RE=1 Rising Edge ansteigende Flanke
   flanke=FE=0 Falling Edge abfallende Flanke
   Interrupt-Service-Routinen ins eigene Programm kopieren:
void ERU0_3_IRQHandler(void)	// ext. Int an P2.9
	{
								// Interrupt-Servie-Routine
	}
//--------------------------------------------------------------------------*/
void ext_interrupt2_init(uint8_t flanke)
{
	ERU0->EXISEL |= 0x00000000; 		//Eingang 3B0 auswaehlen (P2.9)
	if (flanke == FE)
		 ERU0->EXICON[3]=0x00000139; 	// PE=1 , FE (auf fallende Flanke reagieren) , Trigger an OGU3 ,SS=01b fuer B
	else ERU0->EXICON[3]=0x00000135; 	// PE=1 , RE (steigende Flanke Kanal 2) , Trigger an OGU3 ,SS=01b fuer B
	ERU0->EXOCON[3]=0x00000010; 		// GP=1 , OGU3 wird mit NVIC Request Line verbunden
	//CLR_BIT (PORT2->PDISC,9);			// Port 2.9 auf dig. Input
	bit_init_mode(P2, 9, INP, PULLUP);  // Port 2.10 digital, In, Pullup
	ext_clear_IRQ(IRQ2);  						// ISR Anforderungsbit geloescht
	//NVIC_EnableIRQ(ERU0_3_IRQn); 		// Freigabe Interrupt Kanal 3 (CMSIS Bib)
}

/* Externen Interrupt1 initialisieren --------------------------------------
   ERU0 Kanal 2B0 -> Eingang P2.10, abfallende Flanke
   Interrupt-Handler ins eigene Programm kopieren:
void ERU0_2_IRQHandler(void)	// ext. Int bei fallender Flanke an P2.10
	{							// Interrupt-Servie-Routine
	}
   Externen Interrupt2 initialisieren -------------------------------------
   ERU0 Kanal 3B0 -> Eingang P2.9, steigende Flanke
   Interrupt-Service-Routinen ins eigene Programm kopieren:
void ERU0_3_IRQHandler(void)	// ext. Int bei steigender Flanke an P2.9
	{							// Interrupt-Servie-Routine
	}*/
void ext_interrupt_init ( void )	// beide Int Eingänge Init
{
	ext_interrupt1_init(FE);
	ext_interrupt2_init(RE);
}
/*Externen Interrupt1 freigeben --------------------------------------
   ERU0 Kanal 2B0 -> Eingang P2.10, abfallende Flanke
   Interrupt-Handler ins eigene Programm kopieren:
void ERU0_2_IRQHandler(void)	// ext. Int bei an P2.10
	{							// Interrupt-Servie-Routine
	}*/
void ext_interrupt1_enable ( void )
{
	NVIC_EnableIRQ(ERU0_2_IRQn);
}
/* --------------------------------------------------------------------------
   Externen Interrupt2 freigeben
   ERU0 Kanal 3B0 -> Eingang P2.9, steigende Flanke
   Interrupt-Service-Routinen ins eigene Programm kopieren:
void ERU0_3_IRQHandler(void)	// ext. Int an P2.9
	{							// Interrupt-Servie-Routine
	}*/
void ext_interrupt2_enable ( void )
{
	NVIC_EnableIRQ(ERU0_3_IRQn);
}
void ext_interrupt1_disable( void )
{
	NVIC_DisableIRQ(ERU0_2_IRQn);
}
void ext_interrupt2_disable( void )
{
	NVIC_DisableIRQ(ERU0_3_IRQn);
}

void ext_interrupt1_prioritaet(uint8_t prio) {
	if (prio < 4) NVIC_SetPriority(ERU0_2_IRQn,prio);
}

void ext_interrupt2_prioritaet(uint8_t prio) {
	if (prio < 4) NVIC_SetPriority(ERU0_3_IRQn,prio);
}
//NVIC_SetPriority(ERU0_2_IRQn,0);
//***********************************************
/*Interrupt-Service-Routinen*/
// void ERU0_2_IRQHandler(void)// P2.10
//{
			// Interrupt-Servie-Routine
//}
//**********************************************
//void ERU0_3_IRQHandler(void) // P2.9
//{
			// Interrupt-Servie-Routine
//}
//neu
/***********************************************
 * löscht Interrupt-Anforderungsbit
 * IRQ1 für Interrupt 1
 * IRQ2 für Interrupt 2
 */
void ext_clear_IRQ(uint8_t interruptquelle)
{
  if (interruptquelle== IRQ1) {
	  NVIC_ClearPendingIRQ(ERU0_2_IRQn);
  } else {
	  NVIC_ClearPendingIRQ(ERU0_3_IRQn);
  }
}




