2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
/*///////////////////// Achtung!!!!! //////////////////////
Bei der gleichzeitigen Verwendung von Timer und PWM muss darauf
geachtet werden, dass nicht die gleiche CCU40-CCx benutzt wird.
///////////////////////////////////////////////////////////*/

/* --------------------------------------------------------
   Timer-Interrupt 1ms initialisieren
   Timer-Interrupt-Handler ins eigene Programm kopieren:
void CCU40_3_IRQHandler (void)  // Timer-Interrupt jede 1 ms
	{
								// Interrupt-Servie-Routine
    }
 */
void timer1ms_init ( void )
{
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
			// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	//Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC43->TC	= 0x08;		//Shadow transfer enable
	CCU40_CC43->PSC = 0x1;		// Vorteiler , hier 64Mhz/2 => 32 MHzclock
	CCU40_CC43->PRS	= 32000;	//Period Register für 1ms
	CCU40->GCSS = 0b001 << 12; 	//Shadow transfer request  Timer CCU40->CC43
	CCU40_CC43->TCSET = 1; 		//starts counting
	// Interrupt Freigaben:
	CCU40_CC43->SRS |= 0b11;	// Service Req. Line 3
	CCU40_CC43->INTE |= 1;		// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_3_IRQn);  // Freigabe CCU40SR3
}
/* wie timer_start_interrupt();
   Timer-Interrupt-Handler ins eigene Programm kopieren:
	void CCU40_3_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
		{
								// Interrupt-Servie-Routine
    	}*/
/* Timer-Interrupt freigeben */
void timer1ms_enable ( void )
{
	CCU40_CC43->TCSET = 1; 			//starts counting
		// Interrupt Freigaben:
	CCU40_CC43->INTE |= 1;			// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_3_IRQn);  // Freigabe CCU40SR0
}

void timer1ms_disable ( void )
{
	CCU40_CC43->TCCLR = 1; 			//stop counting
}
//***********  Timer ISR : *******************************
//void CCU40_3_IRQHandler (void)
//{
									// Interrupt-Servie-Routine
// }

/* ---------------------------------------alte Funktion
Zeitmessfunktionen mit Timer CCU40_CC43
kann anstelle der 1ms Sek Funktion benutzt werden
Hinweis: zusätzlich verwenden: timer_start();timer_stop();timer_value();
void timer_init(uint8_t teiler)
{	teiler %= 0x10;				// max. 15
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
				// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	// Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC43->TC	= 0x08;		// Shadow transfer enable
	CCU40_CC43->PSC = teiler;	// Vorteiler , hier 64Mhz/2 => 32 MHzclock
	CCU40_CC43->PRS	= 0xffff;	// Period Register für 1ms
	CCU40->GCSS = 0b001 <<12 ; 	// Shadow transfer request  Timer
}*/
/* ---------------------------------------------------------------------
Initialisierung Timer CCU40_CC43, vorteiler 0...15 ergibt Teilung mit 2^vorteiler
                                  periode 1...65536, 64MHz-Takt
Hinweise: Für Zeitmessungen zusätzlich verwenden:
timer_start();timer_stop();timer_value(); timer_reset();
Für timergesteuerte Interrupts zusätzlich verwenden:
timer_start_interrupt();
Timer-Interrupt-Handler ins eigene Programm kopieren:
	void CCU40_3_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
		{							// Interrupt-Servie-Routine
    	} */
void timer_init(uint8_t vorteiler, uint16_t periode)
{	vorteiler %= 0x10;				// max. 15
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
				// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	// Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC43->TC	= 0x08;		// Shadow transfer enable
	CCU40_CC43->PSC = vorteiler;	// Vorteiler , hier 64Mhz/2 hoch Vorteiler
	CCU40_CC43->PRS	= periode;	// Period Register
	CCU40->GCSS = 0b001 <<12 ; 	// Shadow transfer request  Timer
}


// Timer für Zeitmessung starten
void timer_start(void)
{
	CCU40_CC43->TCSET = 1; 		//starts counting
}
/* Timer starten mit Interruptfreigabe
   Timer-Interrupt-Handler ins eigene Programm kopieren:
void CCU40_3_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
{
						// Interrupt-Servie-Routine
} */
void timer_start_interrupt(void)
{
	CCU40_CC43->TCSET = 1; 		//starts counting
	// Interrupt Freigaben:
	CCU40_CC43->SRS |= 0b11;	// Service Req. Line 3
	CCU40_CC43->INTE |= 1;		// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_3_IRQn);  // Freigabe CCU40SR3
}

// Timer stoppen
void timer_stop(void)
{
	CCU40_CC43->TCCLR = 0x1;	// Timer stop
}
// Timerwert lesen
uint16_t timer_value(void)
{
	uint16_t wert;
	wert = CCU40_CC43->TIMER;
	return (wert);
}
// Timer zurücksetzen
void timer_reset(void) // Timer rücksetzen, früher in timer_value enthalten
{
	CCU40_CC43->TCCLR = 0x3;	// Timer stop und clear
}

//Timer 2
void timer2_init(uint8_t vorteiler, uint16_t periode)
{	vorteiler %= 0x10;				// max. 15
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
				// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	// Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC42->TC	= 0x08;		// Shadow transfer enable
	CCU40_CC42->PSC = vorteiler;	// Vorteiler , hier 64Mhz/2 => 32 MHzclock
	CCU40_CC42->PRS	= periode;	// Period Register
	CCU40->GCSS = 0b001 <<8 ; 	// Shadow transfer request  Timer
}


// Timer für Zeitmessung starten
void timer2_start(void)
{
	CCU40_CC42->TCSET = 1; 		//starts counting
}
/* Timer starten mit Interruptfreigabe
   Timer-Interrupt-Handler ins eigene Programm kopieren:
void CCU40_2_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
{
							// Interrupt-Servie-Routine
} */
void timer2_start_interrupt(void)
{
	CCU40_CC42->TCSET = 1; 		//starts counting
	// Interrupt Freigaben:
	CCU40_CC42->SRS |= 0b10;	// Service Req. Line 3
	CCU40_CC42->INTE |= 1;		// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_2_IRQn);  // Freigabe CCU40SR3
}

// Timer stoppen
void timer2_stop(void)
{
	CCU40_CC42->TCCLR = 0x1;	// Timer stop
}
// Timerwert lesen
uint16_t timer2_value(void)
{
	uint16_t wert;
	wert = CCU40_CC42->TIMER;
	return (wert);
}
// Timer zurücksetzen
void timer2_reset(void) // Timer rücksetzen, früher in timer_value enthalten
{
	CCU40_CC42->TCCLR = 0x3;	// Timer stop und clear
}


//Timer 1
void timer1_init(uint8_t vorteiler, uint16_t periode)
{	vorteiler %= 0x10;				// max. 15
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
				// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	// Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC41->TC	= 0x08;		// Shadow transfer enable
	CCU40_CC41->PSC = vorteiler;	// Vorteiler , hier 64Mhz/2 => 32 MHzclock
	CCU40_CC41->PRS	= periode;	// Period Register
	CCU40->GCSS = 0b001 <<4 ; 	// Shadow transfer request  Timer
}


// Timer für Zeitmessung starten
void timer1_start(void)
{
	CCU40_CC41->TCSET = 1; 		//starts counting
}
/* Timer starten mit Interruptfreigabe
   Timer-Interrupt-Handler ins eigene Programm kopieren:
void CCU40_1_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
{
							// Interrupt-Servie-Routine
} */
void timer1_start_interrupt(void)
{
	CCU40_CC41->TCSET = 1; 		//starts counting
	// Interrupt Freigaben:
	CCU40_CC41->SRS |= 0b01;	// Service Req. Line 3
	CCU40_CC41->INTE |= 1;		// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_1_IRQn);  // Freigabe CCU40SR3
}

// Timer stoppen
void timer1_stop(void)
{
	CCU40_CC41->TCCLR = 0x1;	// Timer stop
}
// Timerwert lesen
uint16_t timer1_value(void)
{
	uint16_t wert;
	wert = CCU40_CC41->TIMER;
	return (wert);
}
// Timer zurücksetzen
void timer1_reset(void) // Timer rücksetzen, früher in timer_value enthalten
{
	CCU40_CC41->TCCLR = 0x3;	// Timer stop und clear
}


//Timer 0
void timer0_init(uint8_t vorteiler, uint16_t periode)
{	vorteiler %= 0x10;				// max. 15
	clock_init();
	SCU_GENERAL->CCUCON |= 1;	// Enable CCU40 Modul
				// CCU43 Init:
	CCU40->GIDLC 	= 0x10F; 	// Vorteiler enable für alle Timer , IDLE clear
	CCU40_CC40->TC	= 0x08;		// Shadow transfer enable
	CCU40_CC40->PSC = vorteiler;	// Vorteiler , hier 64Mhz/2 => 32 MHzclock
	CCU40_CC40->PRS	= periode;	// Period Register
	CCU40->GCSS = 0b001 <<0 ; 	// Shadow transfer request  Timer
}


// Timer für Zeitmessung starten
void timer0_start(void)
{
	CCU40_CC40->TCSET = 1; 		//starts counting
}
/* Timer starten mit Interruptfreigabe
   Timer-Interrupt-Handler ins eigene Programm kopieren:
void CCU40_0_IRQHandler (void)  // Timer-Interrupt nach eingestellter Periodendauer
{
				// Interrupt-Servie-Routine
} */
void timer0_start_interrupt(void)
{
	CCU40_CC40->TCSET = 1; 		//starts counting
	// Interrupt Freigaben:
	CCU40_CC40->SRS |= 0b00;	// Service Req. Line 3
	CCU40_CC40->INTE |= 1;		// PME => Period match  Int. enable
	NVIC_EnableIRQ(CCU40_0_IRQn);  // Freigabe CCU40SR3
}

// Timer stoppen
void timer0_stop(void)
{
	CCU40_CC40->TCCLR = 0x1;	// Timer stop
}
// Timerwert lesen
uint16_t timer0_value(void)
{
	uint16_t wert;
	wert = CCU40_CC40->TIMER;
	return (wert);
}
// Timer zurücksetzen
void timer0_reset(void) // Timer rücksetzen, früher in timer_value enthalten
{
	CCU40_CC40->TCCLR = 0x3;	// Timer stop und clear
}

//Extrene kontrolle des Timer 0
//Auswahl zwischen Pin 0, Pin 6 und Pin 12
//Auswahl bei Start zwischen RE=Steigende Flanke und FE=Fallende Flanke
//Auswahl bei Stop zwischen RE=Steigende Flanke und FE=Fallende Flanke

void timer0_extern_controll(uint8_t PIN, uint8_t Start, uint8_t Stopp)
{
	switch (PIN)
	{

	case 0 :  //Pin 0 wurde Ausgewählt
		bit_init(P0, 0, INP);
		if (Start == RE)   //PIN 0 und steigende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF39FF22;
			CCU40_CC40->INS |= 0x1E090022;
		}

		if (Start == FE)  //PIN 0 und fallende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF36FF22;
			CCU40_CC40->INS |= 0x1E060022;
		}
		break;


	case 6:  //Pin 6 wurde Ausgewählt
		bit_init(P0, 6, INP);
		if  (Start == RE)   //PIN 6 und steigende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF39FF11;
			CCU40_CC40->INS |= 0x1E090011;
		}

