2Friendly4You/OptiSort/Microcontroller/XMC1100-LibHaas.c
		if (Start == FE)   //PIN 6 und fallende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF36FF11;
			CCU40_CC40->INS |= 0x1E060011;
		}
		break;

	case 12:  //Pin 12 wurde Ausgewählt
		bit_init(P0, 12, INP);
		if  (Start == RE)   //PIN 12 und steigende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF39FF00;
			CCU40_CC40->INS |= 0x1E090000;
		}

		if (Start == FE)   //PIN 12 und fallende Flanke als Start
		{
			CCU40_CC40->CMC &= 0xFFFFFFF9;
			CCU40_CC40->CMC |= 0x00000009;

			CCU40_CC40->INS &= 0xFF36FF00;
			CCU40_CC40->INS |= 0x1E060000;
		}
		break;
	} // Ende switch
}

//Extrene kontrolle des Timer 1
//Auswahl zwischen Pin 1, Pin 7 und Pin 12
//Auswahl bei Start zwischen RE=Steigende Flanke und FE=Fallende Flanke
//Auswahl bei Stop zwischen RE=Steigende Flanke und FE=Fallende Flanke
void timer1_extern_controll(uint8_t PIN, uint8_t Start, uint8_t Stopp)
{
	switch (PIN)
	{

	case 1 :  //Pin 1 wurde Ausgewählt
		bit_init(P0, 1, INP);
		if (Start == RE)   //PIN 1 und steigende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF39FF22;
			CCU40_CC41->INS |= 0x1E090022;
		}

		if (Start == FE)  //PIN 1 und fallende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF36FF22;
			CCU40_CC41->INS |= 0x1E060022;
		}
		break;


	case 7:  //Pin 1 wurde Ausgewählt

		bit_init(P0, 7, INP);
		if  (Start == RE)   //PIN 7 und steigende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF39FF11;
			CCU40_CC41->INS |= 0x1E090011;
		}

		if (Start == FE)   //PIN 7 und fallende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF36FF11;
			CCU40_CC41->INS |= 0x1E060011;
		}
		break;

	case 12:  //Pin 12 wurde Ausgewählt
		bit_init(P0, 12, INP);
		if  (Start == RE)   //PIN 12 und steigende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF39FF00;
			CCU40_CC41->INS |= 0x1E090000;
		}

		if (Start == FE)   //PIN 12 und fallende Flanke als Start
		{
			CCU40_CC41->CMC &= 0xFFFFFFF9;
			CCU40_CC41->CMC |= 0x00000009;

			CCU40_CC41->INS &= 0xFF36FF00;
			CCU40_CC41->INS |= 0x1E060000;
		}
		break;
	}
}

//Extrene kontrolle des Timer 2
//Auswahl zwischen Pin 2, Pin 8 und Pin 12
//Auswahl bei Start zwischen RE=Steigende Flanke und FE=Fallende Flanke
//Auswahl bei Stop zwischen RE=Steigende Flanke und FE=Fallende Flanke
void timer2_extern_controll(uint8_t PIN, uint8_t Start, uint8_t Stopp)
{
	switch (PIN)
	{
	case 2 :  //Pin 2 wurde Ausgewählt
		bit_init(P0, 2, INP);
		if (Start == RE)   //PIN 2 und steigende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF39FF22;
			CCU40_CC42->INS |= 0x1E090022;
		}

		if (Start == FE)  //PIN 2 und fallende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF36FF22;
			CCU40_CC42->INS |= 0x1E060022;
		}
		break;

	case 8:  //Pin 8 wurde Ausgewählt
		bit_init(P0, 8, INP);
		if  (Start == RE)   //PIN 8 und steigende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF39FF11;
			CCU40_CC42->INS |= 0x1E090011;
		}

		if (Start == FE)   //PIN 8 und fallende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF36FF11;
			CCU40_CC42->INS |= 0x1E060011;
		}
		break;

	case 12:  //Pin 12 wurde Ausgewählt
		bit_init(P0, 12, INP);
		if  (Start == RE)   //PIN 12 und steigende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF39FF00;
			CCU40_CC42->INS |= 0x1E090000;
		}

		if (Start == FE)   //PIN 12 und fallende Flanke als Start
		{
			CCU40_CC42->CMC &= 0xFFFFFFF9;
			CCU40_CC42->CMC |= 0x00000009;

			CCU40_CC42->INS &= 0xFF36FF00;
			CCU40_CC42->INS |= 0x1E060000;
		}
		break;
	}
}

//Extrene kontrolle des Timer 3
//Auswahl zwischen Pin 3, Pin 9 und Pin 12
//Auswahl bei Start zwischen RE=Steigende Flanke und FE=Fallende Flanke
//Auswahl bei Stop zwischen RE=Steigende Flanke und FE=Fallende Flanke

void timer3_extern_controll(uint8_t PIN, uint8_t Start, uint8_t Stopp)
{
	switch (PIN)
	{
	case 3 :  //Pin 3 wurde Ausgewählt
		bit_init(P0, 3, INP);
		if (Start == RE)   //PIN 3 und steigende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF39FF22;
			CCU40_CC43->INS |= 0x1E090022;
		}

		if (Start == FE)  //PIN 3 und fallende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF36FF22;
			CCU40_CC43->INS |= 0x1E060022;
		}
		break;

	case 9:  //Pin 9 wurde Ausgewählt
		bit_init(P0, 9, INP);
		if  (Start == RE)   //PIN 9 und steigende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF39FF11;
			CCU40_CC43->INS |= 0x1E090011;
		}

		if (Start == FE)   //PIN 9 und fallende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF36FF11;
			CCU40_CC43->INS |= 0x1E060011;
		}
		break;

	case 12:  //Pin 12 wurde Ausgewählt
		bit_init(P0, 12, INP);
		if  (Start == RE)   //PIN 12 und steigende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF39FF00;
			CCU40_CC43->INS |= 0x1E090000;
		}

		if (Start == FE)   //PIN 12 und fallende Flanke als Start
		{
			CCU40_CC43->CMC &= 0xFFFFFFF9;
			CCU40_CC43->CMC |= 0x00000009;

			CCU40_CC43->INS &= 0xFF36FF00;
			CCU40_CC43->INS |= 0x1E060000;
		}
		break;
	}
}


void deepSleep_init(void)
{
	PPB->SCR |= 0x00000004;
}
